{"content": "Resume Accomplishment Statements"}
{"content": "Accomplishment statements are the bullets/sentences under the experience section of your resume that describe and quantify your achievements, results, and successes from prior internship, student organization, volunteer, military, or education experiences. When writing these statements, don’t just list your role, responsibilities, and tasks; employers want to also know how you can contribute to their team or organization. Provide specific examples of the impact you made and the value you added during those experiences."}
{"content": "The following guidelines will help you start the process of writing strong accomplishment statements that highlight your qualifications and demonstrate your skills. Before you start writing accomplishment statements, consider the following:"}
{"content": "❓ Have I ever: Improved something? Achieved more with fewer resources or money? Reduced costs? Improved productivity? Saved time? Increased recruitment numbers? Designed, developed, or implemented a new process, program or product? Brought diverse constituents together to accomplish something? Improved morale? Solved a pressing problem? Managed or led a team? Presented complex information clearly? Successfully multitasked? Dedicated long hours of work to accomplish something within a short timeframe? Balanced extracurricular/outside commitments with coursework? Took initiative without anyone asking? Received awards or positive performance reviews?"}
{"content": "❓ Also consider: What are you most proud of? What would others you have worked with say about your contribution? How have organizations benefited from your work? What special projects have you worked on and what was the outcome? What is the tangible evidence of your accomplishments?"}
{"content": "Guidelines for Creating Impactful Resume Accomplishment Statements\n1. Utilize the Action + Project + Result Format\nProject: Group related tasks together into more meaningful projects or activities\nAction: Choose an action verb that describes what YOU did and what YOUR contribution was (NOT your TEAM!) to the project/activity. Highlight what SKILLS you made use of or gained through this experience\nResult: Pitch the result and impact of your work. QUANTIFY the result and impact in terms of % improvement or % increase. If your work resulted (or will result) in a publication or patent, mention that\n✏️ Write it out: [A] Choose an action verb + [P] Name a project you completed or problem you solved + [R] Describe the results you achieved, quantifying when possible"}
{"content": "2. Accomplished [X] as measured by [Y] by doing [Z] Format\n✏️ Write it out: [X] Lead with the impact you delivered + [Y] Numerically measure what you accomplished + [Z] Detail specifically what you did"}
{"content": "Converting to Result Bullets: Before and After\nBefore"}
{"content": "Worked with a student leadership committee to increase member participation\nContributed to system for streamlined application submissions and tracking\nSelected for scholarship\nAfter"}
{"content": "Led a 5-person leadership team to increase student participation by 100% from 50 to 100 members by creating a stronger social media presence\nCollaborated with the IT team to develop an online application submission and tracking system, reducing cost by 10%\nSelected as one of 230 participants nationwide, based on top class rank coupled with community engagement work\nTips\nUse Powerful Action Verbs: While each bullet starts with an action verb, certain action verbs sound more impactful than others. e.g. led, created, developed\nQuantify your Impact: Before revision, bullets are focused mostly on describing activities, not outcomes. It is important to numerically measure what you accomplished through your actions\nContextualize Your Accomplishment: Provide a baseline for comparison to make it easier for recruiters to understand your accomplishment\nConverting to Skill Bullets: Before and After\nBefore"}
{"content": "Explored the evolutionary origins of various cognitive processes by studying capuchin monkeys\nLooked at branding and marketing strategies of Company X in comparison to competitors\nWorked with fellow interns to put on a conference\nAfter"}
{"content": "Delivered key insights on the evolutionary origins of cognitive processes by researching and analyzing over 100 years of literature on capuchin monkeys\nCompiled an overview of the competitive landscape for Company X by conducting expert interviews and online research\nFacilitated collaboration among 5-person intern team to put on a conference; divided tasks based on expertise, developed a feasible timeline, and kept team on task and within budget\nTips"}
{"content": "Pitch Your Skills: Highlight transferable skills you gained from your past experience that your future employer will value (e.g. research, analytic skills, teamwork, communication skills, leadership)\nBe Specific: The inclusion of relevant details shows the reader that the candidate is capable of making an impact in the organization"}
{"content": "I like to have resume bullets try to answer these four questions: What is the achievement? What was my role?"}
{"content": "What was the scope of the achievement? What was the value to the company?"}
{"content": "There is no set order in how you word it as long as I can get most of these answered. Yes, not everything has an easily quantifiable or qualifiable measurement, but if you can't get an answer, then maybe it's not really a good resume bullet point."}
{"content": "The more you can answer these for your bullets the better your resume will be. These days I favor flipping the usual formula:"}
{"content": "Accomplished [A] as measured by [B] by doing [C] using tool [D] Increased A by B percent by creating C with software D"}
{"content": "In a job interview, you can tell a story chronologically using the STAR format. In a resume, begin the phrase with the end of the story: the outcomes"}
{"content": "Manager has a need. The needs are typically met by someone who can do a task and not be an a-hole."}
{"content": "Rarely does an outcome sway me past an eye roll. Outcomes are typically meaningless without context anyway."}
{"content": "Can someone give me examples of Action verb + task/project + outcome that have actually swayed their opinion?"}
{"content": "Resume Accomplishment Statements"}
{"content": "Accomplishment statements are the bullets/sentences under the experience section of your resume that describe and quantify your achievements, results, and successes from prior internship, student organization, volunteer, military, or education experiences. When writing these statements, don’t just list your role, responsibilities, and tasks; employers want to also know how you can contribute to their team or organization. Provide specific examples of the impact you made and the value you added during those experiences."}
{"content": "The following guidelines will help you start the process of writing strong accomplishment statements that highlight your qualifications and demonstrate your skills. Before you start writing accomplishment statements, consider the following:"}
{"content": "❓ Have I ever: Improved something? Achieved more with fewer resources or money? Reduced costs? Improved productivity? Saved time? Increased recruitment numbers? Designed, developed, or implemented a new process, program or product? Brought diverse constituents together to accomplish something? Improved morale? Solved a pressing problem? Managed or led a team? Presented complex information clearly? Successfully multitasked? Dedicated long hours of work to accomplish something within a short timeframe? Balanced extracurricular/outside commitments with coursework? Took initiative without anyone asking? Received awards or positive performance reviews?"}
{"content": "❓ Also consider: What are you most proud of? What would others you have worked with say about your contribution? How have organizations benefited from your work? What special projects have you worked on and what was the outcome? What is the tangible evidence of your accomplishments?"}
{"content": "Guidelines for Creating Impactful Resume Accomplishment Statements\n1. Utilize the Action + Project + Result Format\nProject: Group related tasks together into more meaningful projects or activities\nAction: Choose an action verb that describes what YOU did and what YOUR contribution was (NOT your TEAM!) to the project/activity. Highlight what SKILLS you made use of or gained through this experience\nResult: Pitch the result and impact of your work. QUANTIFY the result and impact in terms of % improvement or % increase. If your work resulted (or will result) in a publication or patent, mention that\n✏️ Write it out: [A] Choose an action verb + [P] Name a project you completed or problem you solved + [R] Describe the results you achieved, quantifying when possible"}
{"content": "2. Accomplished [X] as measured by [Y] by doing [Z] Format\n✏️ Write it out: [X] Lead with the impact you delivered + [Y] Numerically measure what you accomplished + [Z] Detail specifically what you did"}
{"content": "Converting to Result Bullets: Before and After\nBefore"}
{"content": "Worked with a student leadership committee to increase member participation\nContributed to system for streamlined application submissions and tracking\nSelected for scholarship\nAfter"}
{"content": "Led a 5-person leadership team to increase student participation by 100% from 50 to 100 members by creating a stronger social media presence\nCollaborated with the IT team to develop an online application submission and tracking system, reducing cost by 10%\nSelected as one of 230 participants nationwide, based on top class rank coupled with community engagement work\nTips\nUse Powerful Action Verbs: While each bullet starts with an action verb, certain action verbs sound more impactful than others. e.g. led, created, developed\nQuantify your Impact: Before revision, bullets are focused mostly on describing activities, not outcomes. It is important to numerically measure what you accomplished through your actions\nContextualize Your Accomplishment: Provide a baseline for comparison to make it easier for recruiters to understand your accomplishment\nConverting to Skill Bullets: Before and After\nBefore"}
{"content": "Explored the evolutionary origins of various cognitive processes by studying capuchin monkeys\nLooked at branding and marketing strategies of Company X in comparison to competitors\nWorked with fellow interns to put on a conference\nAfter"}
{"content": "Delivered key insights on the evolutionary origins of cognitive processes by researching and analyzing over 100 years of literature on capuchin monkeys\nCompiled an overview of the competitive landscape for Company X by conducting expert interviews and online research\nFacilitated collaboration among 5-person intern team to put on a conference; divided tasks based on expertise, developed a feasible timeline, and kept team on task and within budget\nTips"}
{"content": "Pitch Your Skills: Highlight transferable skills you gained from your past experience that your future employer will value (e.g. research, analytic skills, teamwork, communication skills, leadership)\nBe Specific: The inclusion of relevant details shows the reader that the candidate is capable of making an impact in the organization"}
{"content": ""}
{"content": "There are few shortcuts when it comes to writing an effective resume. Good formatting and layout plus careful targeting to each role you apply for is a must. But there is one simple addition that can benefit everyone. Good resume bullet points."}
{"content": "They’re a great way of giving your content maximum impact and building a solid, easy to read resume structure. And this guide will help you to learn all there is to know about the art of the bullet points for your resume."}
{"content": "Here’s what we’ll cover, in bullet point form of course."}
{"content": "How to write resume bullet points.\nHow many bullet points you should include per job on your resume.\nWhether to include bullet points or paragraphs on a resume.\nAnd you’ll also get examples so you know exactly what to do with your own bullet point resume."}
{"content": "Want to save time and have your resume ready in 5 minutes? Try our AI resume builder. It’s fast and easy to use. Plus, you’ll get ready-made content to add with one click. See 20+ resume templates and create your resume here."}
{"content": "resume bullet points\nresume bullet points\nSample resume made with our builder—See more resume examples here."}
{"content": "One of our users, Chris, had this to say:"}
{"content": "You cannot go wrong with Zety. The company does best at enhancing your resume and helping market yourself better to land the job you love."}
{"content": "And when you’re finished, take a look at our other job-winning resume writing guides."}
{"content": "Accounting Manager Resume Example\nEditor Resume Example\nElectronic Technician Resume Example\nFashion Resume Example\nLaw & Legal Resume Example\nLogistics Resume Example\nMarketing Coordinator Resume Example\nMath Teacher Resume Example\nMusic Teacher Resume Example\nSolution Architect Resume Example\nResume Example for All Jobs\nOffice Manager Resume Bullet Points Example\nMark Sanchez\n202-555-0108\nmsanchez_zety@gmail.com\nlinkedin.com/in/msanchez_zety"}
{"content": "Summary\nDiligent office manager with 8+ years corporate experience, seeking to leverage proven leadership and mentoring skills to grow efficiency at Prescott Global. Oversaw seven administrative assistants in a high-volume engineering firm. Spearheaded efficiency drives that cut annual costs by 25%. Boosted admin team productivity by 30%."}
{"content": "Work Experience\nOffice Manager\nSunco Steel, Seattle\nJune 2016–Present"}
{"content": "Coordinated office operations in a high-volume engineering firm. Oversaw seven administrative assistants to maximize organizational efficiency.\nAccomplished revenue goals through efficient management of task scheduling. Decreased processing times by 45% by removing redundant process steps.\nFacilitated new contract growth by supporting online marketing programs. Grew new customer accounts at a rate of 27% per year.\nPlanned all admin team daily work schedules. Grew team through positive performance feedback and effective annual appraisals. Decreased turnover by 50%.\nOffice Assistant\nConiston Machine Supplies, Seattle\nAugust 2012–June 2016"}
{"content": "Effectively handled administrative office assistant tasks in a busy manufacturing firm.\nOnboarded and mentored two new office assistants, including orientation training and acting as “onboarding buddy” during initial stages of employment.\nLed on inventory tracking and ordering supplies. Saved 20% on supplies contracts through negotiating bulk purchase discounts with suppliers.\nEducation"}
{"content": "Communication & Media BA, Seattle University, Washington\n2009-2012 Skills"}
{"content": "Leadership skills\nCommunication skills\nBusiness operations management\nScheduling\nInventory management\nAttention to detail\nPreparing reports\nCustomer service\nHobbies & Interests"}
{"content": "Chess: Avid player and volunteer facilitator for community chess and checkers club\nForeign Languages"}
{"content": "Spanish: Fluent\nWhy Should You Use Bullet Points for Your Resume?\nBullet points help you draw attention to critical details, making it easier for readers to scan and absorb the information quickly. That's why using bullet points in your resume is so important. It allows employers notice your skills and experience at once. Resume bullets are particularly useful for explaining your professional achievements and responsibilities for the jobs in your work experience section. You can also use bullet points in your skills section and other parts of your resume where you need to organize information and make it easier to read."}
{"content": "When Can You Use Resume Bullet Points?\nEvery type of resume can benefit from bullet points. They’re a useful resume layout trick that’s equally applicable to chronological, combination or functional resumes. And bullet points can be used throughout your resume structure."}
{"content": "Read more: The Best Resume Format"}
{"content": "How to Use Bullet Points in Your Resume\nAs you’ve just seen, bullet points are useful in every part of your resume. Strictly speaking, bullet points are simply symbols used in typography to introduce items in a list. But they actually do much more than that. In a resume, bullet points help break up blocks of text, add emphasis and divide information into neat portions."}
{"content": "That’s important, because recruiters and hiring managers want to be able to read fast and pick out the information they want easily. So bullet points divide everything up into easy to spot, bite size chunks. Perfect for information hungry employers."}
{"content": "Most advice you’ll find about resume bullet points focuses on your work experience section. And yes, that is the classic place to use them. But we’re going to show you how to put those helpful dots to use in every resume section along with some resume bullet points examples."}
{"content": "1. Resume Header\nStarting from the top, bullet points are a useful addition to your resume header. Use them to neatly pick out your contact information, so employers can see how to get in a touch at a glance."}
{"content": "Resume Bullet Points Example: Resume Header resume bullet points"}
{"content": "2. Resume Profile\nYes, bullet points can be put to good use in your resume profile. That’s the brief, introductory section that kicks off your resume proper. You won’t see them in a standard resume objective or sresume summary. But they come into their own if you choose to write a summary of qualifications."}
{"content": "It’s essentially a brief guide to your relevant experience, skills, and professional achievements. And it’s intended to show your qualifications tailored to the job you’re applying for. That information is usually presented in bullet point form, like the following example."}
{"content": "Resume Bullet Points Example: Resume Profile"}
{"content": "Customer service manager with 10+ years experience in busy shared services centers.\nMaintained a team average 96% plus customer satisfaction score.\nSpearheaded a comprehensive training program that increased call handling speeds by 15%.\nHad team processes selected as the standard for customer service across the company.\nRead more: How to Write a Resume Introduction (Intro Paragraph Example)"}
{"content": "3. Work Experience Section\nThis is the standard section to include resume bullet points. Here’s how to write it."}
{"content": "List your work history in reverse chronological order.\nStart off with the basic details about the position, your job title, employer’s name and location and dates of employment. \nThen under each job write bullet points that describe your role.\nDon’t just say what you did, prove what you achieved in the role. Use accomplishment statements, the STAR (Situation, Task, Action, Result) formula and quantified achievements to prove your worth. Numbers help give more impact to your words.\nResume Bullet Points Example: Work Experience Section"}
{"content": "Office Manager Sunco Steel, Seattle June 2016–Present"}
{"content": "Coordinated office operations in a high-volume engineering firm. Oversaw seven administrative assistants to maximize organizational efficiency.\nAccomplished revenue goals through efficient management of task scheduling. Decreased processing times by 45% by removing redundant process steps.\nFacilitated new contract growth by supporting online marketing programs. Grew new customer accounts at a rate of 27% per year.\nPlanned all admin team daily work schedules. Grew team through positive performance feedback and effective annual appraisals. Decreased turnover by 50%.\nOffice Assistant"}
{"content": "Coniston Machine Supplies, Seattle August 2012–June 2016"}
{"content": "Effectively handled administrative office assistant tasks in a busy manufacturing firm.\nOnboarded and mentored two new office assistants, including orientation training and acting as “onboarding buddy” during initial stages of employment.\nLed on inventory tracking and ordering supplies. Saved 20% on supplies contracts through negotiating bulk purchase discounts with suppliers.\nHow many bullet points per job on a resume?\nWrite between 3–6 bullet points per job in your work experience section. Make them 1–2 lines each. Use more bullet points for your most recent and relevant experience."}
{"content": "Read more: How to Write Your Resume Work Experience Section"}
{"content": "4. Education Section\nAnother unexpected spot resume bullet points come in useful is in your education section. This is a useful addition to resumes for candidates with no experience, particularly students and new graduates. You can add a couple of bullet points immediately below your standard education info to highlight key skills and knowledge that are relevant to the job you’re targeting. Here are some ideas, followed by an example."}
{"content": "Relevant coursework\nExtracurricular activities\nHigh GPA (3.5 or above)\nDean’s list\nLatin honors\nResume Bullet Points Example: Education Section"}
{"content": "Communication & Media BA, Seattle University, Washington 2017-2020"}
{"content": "Relevant coursework: Audience Behavior, Digital Marketing, Gaming and Virtual Environments\nGPA: 3.7\n5. Skills Section\nMost people are also familiar with bullet points in their resume skills section. But to make it effective you can’t just choose a random list of abilities. As with the rest of your resume, you need to be targeted. Read the job ad, note the skills and requirements for the role and make sure your skills section matches it as closely as possible within your own abilities. Here are some more tips to improve your skills section bullet points."}
{"content": "Write 5–10 relevant skills bullet points. The number will depend on the space you have available and the technical demands of the job.\nUse a mix of hard and soft skills and remember that some abilities are transferable skills that are desirable in almost every career. Good examples include communication skills, analytical skills and IT skills.\nResume Bullet Points Example: Skills Section"}
{"content": "Skills"}
{"content": "Leadership skills\nCommunication skills\nBusiness operations management\nScheduling\nInventory management\nAttention to detail\nPreparing reports\nCustomer service\n6. Additional Sections\nAdding extra sections to a resume gives you the chance to add more proof of your abilities and experience. Good examples include volunteering, foreign languages, hobbies and personal interests, and relevant projects."}
{"content": "And all of these extra sections can make use of resume bullet points too. Here’s a couple of examples."}
{"content": "Resume Bullet Points Examples: Additional Sections Hobbies & Interests"}
{"content": "Chess: Avid player and volunteer facilitator for community chess and checkers club\nForeign Languages"}
{"content": "Spanish: Fluent\nMaking a resume with our builder is incredibly simple. Follow our step-by-step guide, use ready-made content tailored to your job and have a resume ready in minutes."}
{"content": "A view from the Zety resume constructor revealing the process of populating the work experience section and a range of pre-written resume descriptions proposed for the specific occupation.\nWhen you’re done, our AI resume builder will score your resume and our resume checker will show you exactly how to improve it."}
{"content": "How to Write Resume Bullet Points\nYou can’t just throw in resume bullets and hope for the best. The spray and pray approach is a prime example of what not to put in a resume. You need to use the right tactics and create well-written bullet points that enhance your content and help to show off your writing skills. Here are some easy to implement ideas to create a top-notch bullet resume."}
{"content": "Tips for Writing Good Resume Bullet Points\nStart each bullet point off with a resume action word for extra impact.\nLink experience and skills with accomplishments. Don’t just write a laundry list of your abilities, use your resume bullet points to prove that you have the potential to be a productive employee.\nQuantify your achievements with numbers. Measurable results and metrics make for strong bullet points.\nUse active voice and simple language when writing each resume bullet. \nUse sentence fragments rather than whole sentences. E.g. “Generated $500k in profits to increase revenue by 30%.”\nDon’t save the best for last. Start your bullet point list with the most impressive/relevant skill, experience or accomplishment.\nBe consistent with your formatting. Circles, squares and diamonds all make effective bullet symbols, but stick to the same resume style throughout.\nStay relevant and don’t be generic. Aim for a targeted resume by ensuring the information in your bullet points focuses on how you fulfil the key requirements for the job. \nBullet Points or Paragraphs on a Resume: Which is Better?\nThere’s no contest. Bullet points are always better than paragraphs on a resume. They increase the amount of white space on the page and improve layout. In short, they improve readability, comprehension and user satisfaction."}
{"content": "What more could you want than a satisfied hiring manager who can easily understand why you’re the best candidate?"}
{"content": "Should Resumes Have Periods After Bullet Points?\nIt’s a contentious point, but the generally agreed rule is that you have to include a period if you’ve written your resume bullet points as complete sentences. If they’re fragments however you can leave it out. But consistency remains key, don’t have some bullet points in a list with periods and some without, it’ll just look messy."}
{"content": "Plus, a great cover letter that matches your resume will give you an advantage over other candidates. You can write it in our cover letter builder here. Here's what it may look like:"}
{"content": "A duo of professional job application documents that match, including a resume and cover letter, created using the Zety resume generator with the Modern resume template featuring a two-column structure and decorative rectangles in the header and footer areas. \nSee more cover letter templates and start writing."}
{"content": "Key Takeaway\nPutting bullet points on your resume is one of the simplest ways to make it more impactful and better at doing what it’s designed to do. Making your job hunt a success. Follow the tips you’ve just seen and you can be sure you’re getting the most out of this handy typographical tool."}
{"content": "Thanks for reading. If you need more advice on writing a resume with bullet points then please ask in the comments section and we’ll be happy to help."}
{"content": "Bullet points comprise the bulk of your resume, so it’s essential you know how to make them impactful."}
{"content": "Your bullet points aren’t just a list of tasks you’ve completed — they’re a showcase of your skills, accomplishments, and the impact you’ve made."}
{"content": "Keep reading to learn how to craft effective bullet points when writing your resume."}
{"content": "Build My Resume\nOur resume builder can make you a resume in as little as 5 minutes. Pick the template you want, and our software will format everything for you."}
{"content": "1. Use the STAR method\nYou might have heard of the STAR method in the context of job interviews, but it’s also effective for writing impactful resume bullets."}
{"content": "STAR method\nSituation: Briefly describe the context of a challenging situation you found yourself in at work.\nTask: Specify your responsibility or objective in this situation.\nAction: Explain the specific steps or strategies you took to address the situation.\nResult: Highlight the outcome or impact of your actions."}
{"content": "By following this method, your resume bullet points will demonstrate your achievements in a clear, engaging, and result-oriented manner."}
{"content": "Here’s an example of how to write a STAR method resume:"}
{"content": "Increased customer satisfaction by 18% (Result) by implementing a feedback system (Action) during a company-wide effort to improve service quality (Task) in response to low survey scores across the department (Situation)"}
{"content": "2. Start with action verbs\nAction verbs are words that make you come across as someone who takes initiative instead of just following instructions."}
{"content": "Starting your bullet points with action verbs like the ones below instead of passive phrases like “responsible for” or “tasked with” will make your resume more impactful:"}
{"content": "Optimized\nLed\nDeveloped\nImplemented\nSpearheaded\nDesigned\nResolved\nCoordinated\nEnhanced\nDelivered\nRemember that the bullet points for your current job should be written in the present tense."}
{"content": "3. Focus on your top achievements\nMany job seekers believe the more information they can fit on their resume, the better. However, it’s actually better to keep your resume concise and focused."}
{"content": "22% of hiring managers spend less than one minute scanning each resume, making it important to prioritize your more relevant achievements."}
{"content": "Focus on emphasizing accomplishments that show why you’re a good fit for your target role and company, and omit information from other, less relevant jobs."}
{"content": "For example, if you were applying for an HR role, one of your resume bullets might look something like this:"}
{"content": "Streamlined onboarding processes, reducing employee training time by 12% and increasing team productivity\n4. Highlight keywords from the job description\nNot sure what you should include in your resume bullet points? Check the job description for clues."}
{"content": "Write down resume keywords that describe the employer’s ideal candidate, such as:"}
{"content": "Personality traits\nSkills\nExperience\nCertifications\nDegrees\nOnce you have a list of keywords, incorporate those that apply to you and your background into your bullet points. This helps align your resume with the job description and make your qualifications more compelling."}
{"content": "Remember to be careful not to overuse the same keyword repeatedly, and don’t copy the job description word-for-word."}
{"content": "5. Quantify your accomplishments\nWhenever possible, add specific metrics to your resume bullet points. Quantifying your achievements helps employers understand the scale of the impact you’ve made through your work."}
{"content": "For example, instead of saying that you managed the sales team, mention how many team members you managed and how much sales increased under your leadership. The more specific you are, the easier it is for employers to imagine what you can contribute to their team."}
{"content": "Additionally, including hard numbers in your resume bullet points shows that you’re goal-oriented and used to tracking your progress."}
{"content": "Want to speed up the process of making bullet points for your resume? Use a resume bullet point generator to do the work for you."}
{"content": "Resume bullet point examples\nHere are more examples of resume bullet points for different types of roles:"}
{"content": "Assistant manager\nManaged, directed, and prioritized gym operational budget of $65M, staying within budget\nOverhauled sales process and systems to achieve revenue goals, hitting targets of 17% revenue increase annually\nWorked to provide strategic, operational, and fiscal leadership while working to reach the company’s long-term goals and maintain organizational vision\nDirected the hiring, training, and scheduling of all gym-level associates by an intermediary\nLibrarian\nSpearheaded a silent function fundraising activity raising over $3000 in library donations\nCoordinated children’s library operations and promoted special activities through list campaigns\nProcessed new materials, including audio-visual materials, books, and computer software\nChecked books in and out in a library serving 25,000+ patrons\nNetwork engineer\nApplied routing changes including BGP, OSPF, RIP, PIM, and EIGRP, which improved network/system performance by 40%\nMaintained seamless end-to-end communication by delivering support for Video Conferencing System (Cisco VCS/TMS)\nDesigned, configured, and installed all Data Center Network Devices to support 1000+ users, including ran cables, ports, routers, switches, Load Balancers, and VPNs\nEffectively resolved routing issues within multiple contexts of the Cisco ASA firewall\nDetected 20+ network vulnerabilities by testing infrastructure security and tracking potential threats to the network\nVolunteer\nOrganized a school-wide canned food drive that collected 400+ cans in one month\nAssisted in bi-weekly meal preparation and lunch service on Saturdays\nProcessed incoming food donations and organized food pantry, developing new system of grouping items by expiration date to reduce monthly food waste by 15%\nConference planner\nArranged participant accommodation and transportation, and negotiated contracts with conference site providers\nConsistently saved clients an average of 5% in budget costs through careful market analysis\nPerformed post-conference evaluations and negotiated discounts with favored site and equipment providers for future events\nFrequently asked questions about resume bullet points\nHere are answers to some of the most common questions job seekers have about resume bullets:"}
{"content": "How many bullet points should you list per job on your resume?\nYou should list between three to five bullet points per job on your resume, unless you’re making a master resume. This should be enough to showcase your most relevant work experience while keeping your resume within the recommended length of one page."}
{"content": "Do you put periods after bullet points on a resume?\nNo, you don’t put periods after bullet points on a resume because resume bullet points aren’t typically written as complete sentences."}
{"content": "However, if you do use complete sentences on your resume, you should add periods."}
{"content": "How long should resume bullet points be?\nResume bullet points should be 1-2 lines long. A 3-line bullet point isn’t going to cost you the job, but keeping your bullets concise will ensure your resume is easy to skim."}
{"content": "A good rule of thumb is to highlight one career highlight in each bullet point of your resume to keep it organized."}
{"content": "Should I use bullet points in my resume?\nYes, you should use bullet points in your resume. Well-written bullet points make your achievements stand out on the page. The only time you should use paragraphs is when you write resume summaries."}
{"content": ""}
{"content": "Resumes with Impact: Creating Strong Bullet Points\nStudent working with counselor on their resume\nHow can you make your resume stand out to an employer?"}
{"content": "Use an easy-to-read format and structure that highlights your relevant education and experience.\nDevelop bullet points or statements to show relevant skills and qualities. Be specific about what you did and how you did it.\nStart your bullet points or statements with strong action verbs.\nProvide contextual details to inform the reader about the purpose of your work, the scope of the project, and what you produced or accomplished.\nQuantify your work and achievements where possible.\nUsing the STAR method\nThe STAR method can help you create impactful descriptions for each experience on your resume."}
{"content": "First, read through the posting for a job that interests you. This will help you understand the role and the employer’s needs. Identify the skills and qualities they seek. You can usually find them in the responsibilities and qualifications sections."}
{"content": "Next, use the STAR method to describe the context of your work, your actions, and how your actions had positive impact on the organization."}
{"content": "Situation: What was the situation, problem, or conflict you were facing?"}
{"content": "Task: What were you tasked with? What were your responsibilities or goals?"}
{"content": "Action: What action did you take? What did you do to solve this problem? (start with action verbs)"}
{"content": "Result: What was the result or outcome of your action? How did it benefit the organization? Can this result be quantified?"}
{"content": "Follow the STAR method to create descriptions that incorporate the key skills and qualities the employer is seeking. Your ﬁnal statement will start with the action section and include the results section when appropriate."}
{"content": "Example\nSkills/qualities you want to show: initiative, organization, analytical thinking, writing, interpersonal skills, problem solving"}
{"content": "Situation: The trainees were learning too slowly and could not navigate the company’s data tracking system by the end of the two-week training period. Instead, they were not ready for another two weeks."}
{"content": "Task: Help trainees learn the system faster."}
{"content": "Action: Initiated, wrote, and edited the first training manual for the company’s data tracking system. Successfully presented proposal to use manual to management. Revised training program curriculum to implement new manual. Trainees worked through the manual during the two-week training period."}
{"content": "Result: At the end of the training period, trainees were ready to use the data tracking system two weeks earlier than expected; the training manual was adopted across the company and is still in use."}
{"content": "FINAL STATEMENT FOR RESUME: Initiated, wrote, and edited the first training manual for company’s data tracking system, which cut training period in half, was adopted across the company, and is still in use today."}
{"content": "This example could focus on different skills (communication, persuasion, leadership, training), depending on what’s relevant to the job."}
{"content": "Bullet Point Examples\nWhat, How, and Why\nAnswer these questions to transform a generic description into an impactful  bullet point."}
{"content": "WHAT\nWhat did you do? What was the situation, problem, or challenge you were facing?\nWhat were your responsibilities or goals?\nHOW\nHow exactly did you do it? How did you accomplish your tasks? Did you use any tools, equipment, or computer programs?\nDid you work as part of a team or independently?\nWHY?\nWhy are these actions important? How did they benefit the organization? What was the result or outcome of your actions?\nCan you quantify the results? (Note: Not every bullet point on your resume must be results-oriented.)\nGeneric Description\nPublic Health Society, Events Coordinator"}
{"content": "Responsible for organizing events and panels\nIn this example, it is not clear what the candidate did to organize events and panels, what skills they used, or what kind of events and panels they organized. Because of this, the writer misses the chance to showcase the skills used to carry out this task."}
{"content": "Strong, Concrete Description\nPublic Health Society, Events Coordinator"}
{"content": "Plan and coordinate panels on public health for audiences of 25–50 undergraduates on a bi-monthly basis\nIdentify and contact health professionals in the community to participate in panels\nCreate marketing materials and publicize events through social media\nAdd context and skills (WHAT was the situation and HOW were the tasks accomplished) to deepen the information provided."}
{"content": "In this example, the first bullet point clearly highlights organizational skills. It also lets the employer know the scope, target audience, and frequency of the events. This efficiently illustrates the candidate’s abilities and experience."}
{"content": "The second bullet point indicates research and interpersonal skills, which were used to secure panelists. It also demonstrates the ability to communicate with professionals outside of the university."}
{"content": "The third bullet highlights a specific business skill and/or the ability to be strategic in marketing, as well as familiarity with using social media for marketing purposes."}
{"content": "Adding Accomplishments and Impact:\nEmployers review resumes to understand the impact you’ve had on a project, organization, or company. Explain WHY your actions matter; how did your actions affect outcomes? For instance:"}
{"content": "Were the materials and publicizing efforts successful?\nDid these actions result in reaching a new group of students?\nReview each statement you’ve created for your resume. Can you add an accomplishment or achievement? What happened as a result of that action? How did it benefit the organization? You don’t need to add a result to every bullet point on your resume, but it’s helpful to demonstrate achievements when possible."}
{"content": "What does this look like? In the bullet point about marketing materials and social media, this might read:"}
{"content": "Create marketing materials and publicize events through social media. Increased attendance at several club programs by 75% (if you have an accurate figure)\nCreate marketing materials and publicize events through social media. Saw increased attendance at several club programs throughout the year (if you are unable to quantify)\nThese statements combine the Action and Result sections of the STAR method."}
{"content": ""}
{"content": "How to Quantify Your Resume: What Recruiters Look For (50+ Examples)\nOne of the simplest and most effective resume strategies is to quantify your resume achievements with numbers and data. Here are recruiter-backed advice on how to do it with 50+ examples you can copy today!"}
{"content": "By Rohan Mahtani\n \nTable of contents"}
{"content": "A 2018 study found that recruiters spend an average of 7.4 seconds skimming through each resume they receive. When you’re applying for jobs, you only have that brief window to hook a recruiter’s attention — so your resume needs to pack a punch."}
{"content": "How do you create a memorable, impactful resume that will help you get more interviews in 2024? One of the simplest and most effective strategies is to quantify your resume achievements with numbers and data. We’ll break down that concept in more detail below."}
{"content": "What does it mean to quantify your resume?\nAccording to the previously-mentioned study, many hiring managers prefer to see resumes with bulleted lists of achievements in the work experience section. These bullet points should be short, bite-sized, and easily scannable for quick reading. The most memorable and effective bullet points feature examples of your past achievements quantified with specific metrics, as in the resume sample below."}
{"content": "An example of quantified bullet points you can use on your resume\nAn example of quantified bullet points you can use on your resume\nNotice how each bullet point references specific numbers (e.g. “reduced development costs by 25 percent”) in connection with the candidate’s achievements. These points are great examples of quantified achievements. The more quantified achievements you can include in your resume, the more you will stand out in a recruiter’s eyes."}
{"content": "Easy ways to quantify your resume\nThere are many ways to add quantifiable metrics to the work experience bullet points of your resume. You should always choose numbers that are most relevant to your industry, whether it’s the amount of revenue you generated, the costs you reduced, or the processes you streamlined for greater efficiency. Here are some of the best and easiest ways to quantify your resume:"}
{"content": "Revenue, profit, or sales generated\nIncreased (or reduced) x by y%\nTime saving\nProject or data size\nQuantity of work\nTime commitment\nRevenue, profit, or sales generated\nUltimately, any recruiter who is considering hiring you wants to know: can you add to their bottom line? Are you going to be a profitable addition to their company? Showing how you’ve generated revenue, boosted sales, cut costs, or increased profit for past employers can make you a very desirable candidate."}
{"content": "Of course, this metric works best with sales and business positions that directly generate revenue — not all jobs lend themselves to being quantified in this way. But if you can measure your impact in the number of dollars you’ve brought in, don’t be shy about saying so."}
{"content": "You should aim to quantify most of your bullet points with numbers, metrics and data. I’d recommend trying out the tool below to check if your resume has enough uses of numbers, data and quantifiable accomplishments. It's a good litmus test to figure out if you’ve checked all the boxes from a hiring manager’s perspective."}
{"content": "Example bullet points:"}
{"content": "Designed and executed company-wide digital marketing strategy that drove $500,000 in product sales\nOrganized a series of community fundraising events with 250+ attendees; generated $100,000 in donations\nIncreased (or reduced) x by y%\nYou can use this versatile metric for any job where you’ve made a difference. If you’ve been in a marketing or similar role, you could discuss how you grew your brand’s readership or audience size. Or, in a customer service job, you could talk about how you achieved a reduction in customer complaints or negative online reviews. If you don’t know the exact percentage of the change you achieved, it’s okay to provide your best estimate."}
{"content": "You can also give examples of where you’ve improved processes or working conditions. Increasing productivity, employee satisfaction, and other aspects of the workplace can be very impactful for companies, so they’re valid metrics to call out in your resume."}
{"content": "Example bullet points:"}
{"content": "Led intensive customer service training for all sales staff, creating a 65% reduction in customer complaints\nProvided individualized coaching and feedback for employees on a quarterly basis, leading to a 25% increase in workplace satisfaction\nTime saving\nYou know the saying – time is money. Saving valuable company time can be as significant to the bottom line as directly saving money, which makes it an excellent thing to quantify on your resume. You can approach this on a small scale by detailing the number of hours you saved by streamlining the efficiency of your own projects, or on a larger scale by estimating the total number of man hours you saved for your company."}
{"content": "Example bullet points:"}
{"content": "Led 2 business analysts to automate repetitive process flows using Excel Macros / VBA and reduced analysis time by 10+ hours per week\nBuilt Tableau dashboard to visualize core business KPIs (e.g. Monthly Recurring Revenue), saving 10 hours per week of manual reporting work\nProject or data size\nRunning a two-person team or planning a dinner for 5 people is very different from overseeing a 500-person department or organizing an event for 200 attendees. Make the scale of your accomplishments clear to a hiring manager by including quantifiable metrics like the size of your department, event, budget, or data set."}
{"content": "Example bullet points:"}
{"content": "Developed a prototype to identify key influencers on Twitter using clustering techniques over 100,000 data pointsin Python\nManaged a process re-engineering project to improve and consolidate end-to-end service processes; restructured communication flow among 10 departments, and cut down paperwork by 75%\nDirected agency fundraising revenue generation, daily program business operations, community outreach membership recruitment, and human resources in 30 suburbs in the city for organizations with assets of $8M\nQuantity of work\nYou can also choose to focus on the quantity of work you completed – for example, the number of projects completed, number of employees onboarded, or training facilitated. This doesn't need to be an exact figure, giving a range or an approximate figure is fine."}
{"content": "Example bullet points:"}
{"content": "Hired, trained, and managed over 355 part-time workers per year\nCoordinated mailing over 40,000 invitations, formal letters, and information packets annually\nTime commitment\nIt's one thing to say that you're a committed employee, but quite another to have the numbers to back it up. If you were promoted ahead of schedule, routinely go the extra mile to help out, or have a track record of putting in overtime to make sure important deadlines are met, and you don't mind doing the same at your next job, go ahead and include those accomplishments."}
{"content": "Example bullet points:"}
{"content": "Promoted within 12 months due to strong performance and organizational impact (one year ahead of schedule)\nWorked 16 days nonstop to ensure all KPIs were met for on-time product launch\nFour effective ways you can quantify your resume, with examples\nFour effective ways you can quantify your resume, with examples\nHow to strengthen existing resume bullet points with metrics\nBy now, hopefully, you’re starting to see what a powerful tool these quantified bullet points can be. They convey confidence and send a strong message to hiring managers about your ability to excel in a job."}
{"content": "But what if you already have a resume that’s riddled with unquantified bullet points? Not to worry — you don’t have to scrap the whole document and start fresh! Instead, you can rework each point, filling in more detail and adding those specific numbers to illustrate what you achieved, or use our handy bullet point builder to get you started."}
{"content": "Let’s look at a few “before and after” examples that will show you how to convert weaker, non-quantified bullet points into stronger, quantified ones. The weaker examples are vague and nonspecific, while the stronger ones are much clearer and more detailed."}
{"content": "Table 1\nColumn 1\tColumn 2\nWeaker (non-quantified)\tStronger (quantified)\nHelped create a new production process designed to reduce waste\tStreamlined production process, reducing costs by 30% and increasing profits by $3 million per year\nResponsible for improving productivity among workers\tConducted workload assessments and devised new operational processes that led to a 40% increase in productivity\nAssisted with generating increased website traffic through marketing efforts\tImplemented and managed 6-month social media marketing campaign; generated 50,000 unique website visits per month\nAdministered therapy to clients seeking help with various challenges\tCounseled 15-20 clients per week on marital, family, and substance abuse issues; provided advocacy and support services\nParticipated in student engineering club\tElected president of student engineering club; facilitated monthly meetings of 25 members\nHow to use quantified metrics to create impactful power phrases\nOnce you have decided how to quantify your skills, you want to present these numbers in a way that will grab a recruiter's attention. That’s where power phrases come in."}
{"content": "Creating a power phrase is simple. Choose a task or project where you demonstrated a skill and decide how to quantify that skill using one of the methods above. Then all you have to do is choose an action verb from our list to start your statement, and you have a strong power phrase to add to your resume. Use these phrases throughout your resume, particularly in your resume summary and work experience sections, and to optimize your LinkedIn profile."}
{"content": "Compare your phrases against the template below, or use our Score My Resume tool to analyze the impact of your statements and provide feedback on how to improve your word choice, impact, brevity and style."}
{"content": "More examples of quantifying your resume, handpicked by recruiters\nExamples are always helpful, so here's a collection of resume bullet points that are correctly quantified and handpicked from successful resumes."}
{"content": "Analyzed data from 25000 monthly active users and used outputs to guide marketing and product strategies; increased average app engagement time by 2x, decreased drop off rate by 30%, and increased shares on social media by 3x over 6 months\nSpearheaded retail distribution expansion into 8 new territories and markets in South Brazil; resulted in 85% sales growth and the fastest growing sales location in South America in 2015\nScripted and tested phone sales process; increased customers by 30% in 6 months\nGrew revenue from $1MM to $2.5M in one year by expanding channel partnerships; exceeded target by 150%\nAnalyzed company's 24-month sales results to develop five-year monthly projections by revenue and customer type\nDeveloped and executed customer referral program, leading to 50% increase in referral business and $2MM of incremental revenue\nLed evaluation and selection of new CRM system; spearheaded a cross-functional team (Technology, Business Development, Management) to implement the system; successful adoption accelerated revenue growth by 25% in 1 year\nLed a 10-week engagement in a four-member team for a solar energy provider; assessed 30+ locations and provided a recommendation for the most suitable location of their new headquarters\nLed six-member cross-functional team across four offices to implement a new CRM system; system is used by 300+ employees globally\nPay close attention to the metrics and numbers used to quantify each bullet point. Like we discussed above, effective metrics can be dollar amounts (e.g. revenue, sales), size of teams of users (e.g. employees worked with), or percentages."}
{"content": "For more resume bullet points and templates, visit sample resume bullet points."}
{"content": "How to quantify your resume for different industries\nThe best quantifiable achievements to choose vary depending on your industry. For instance, in sales, annual targets and increased revenue are good to focus on, while in education, innovative teaching methods and improved student test scores would be equally impressive. Similarly, streamlined workflows are great to highlight in project management, while in healthcare, you could mention the number of patient contacts or ongoing education credits."}
{"content": "Here are some more specific examples for various industries:"}
{"content": "Sales: \"Revamped product presentation strategy, leading to a 25% increase in customer engagement and a 10% rise in sales.\"\nData Analysis: \"Leveraged data visualization tools to present monthly sales trends, leading to a more effective resource allocation strategy and a 10% reduction in overhead costs.\"\nMarketing: \"Initiated a social media campaign that increased web traffic by 40%, contributing to a 15% rise in online sales.\"\nEducation: \"Redesigned the curriculum for 11th-grade biology, leading to an 18% improvement in average student scores.\"\nProject Management: \"Implemented a new project tracking tool, leading to a 20% reduction in project completion times.\"\nHealthcare: \"Introduced a digital patient record system, resulting in a 30% decrease in information retrieval time.”\nManufacturing: \"Implemented a Lean manufacturing technique, which reduced production time by 20% and increased overall productivity by 15%.\"\nDigital & E-commerce: \"Optimized SEO strategies to boost the website's organic traffic by 35% over six months.”\nFAQs\nWhy do I need to quantify my resume?\nHiring managers don’t just want to hear about your talent and abilities; they want to see proof of what you’ve actually accomplished in the past. They want to know that you’ve had a positive impact in your previous jobs and that you’re capable of excellent work."}
{"content": "When you quantify your resume accomplishments with specific numbers, you’re not just making empty claims about your skills and experience -- you’re backing your claims up with evidence. Quantified achievements are far more meaningful and concrete than vague statements about what you were “responsible for” at a previous job, and they can also help differentiate you from your competition."}
{"content": "What should I do if I don’t have access to numbers from my previous jobs?\nWhen you’re quantifying your achievements, you may not always know the exact number of dollars you brought in or the percentage of growth you created. If that’s the case, don’t panic -- all you need to do is provide your best guess."}
{"content": "For example, if you upgraded some machinery and made your company’s operations more efficient, you could estimate how many hours of labor those new machines saved per week. To take it a step further, you could multiply these weekly labor hours by the average hourly employee pay to give a rough idea of how much money the machines saved."}
{"content": "In certain jobs, such as those where you help coach, mentor, and guide other people, it may be challenging to think of tangible, measurable achievements to list on your resume. In these cases, you could focus on metrics such as the number of clients you’ve served or new team members you’ve hired."}
{"content": "What if I’m a student or recent graduate with limited work experience?\nIf you don’t have much work history yet, focus your resume on any relevant experiences you have had -- they could be courses you took in school, internships you’ve held, or extracurricular projects you’ve done. Recruiters know that those activities are valuable learning experiences, and they often teach you transferable job skills."}
{"content": "List these experiences on your resume as if they were jobs, and create bullet points for each one, as shown in the example below. Call out achievements that can be quantified, such as the number of donors you generated, networking events you organized, or students who participated in your training."}
{"content": "Examples on how to quantify your resume as a student with limited work experience\nWhat if I can't think of any ways to quantify my accomplishments?\nSome accomplishments are easier to quantify than others. If you worked in sales, finance, or anything else particularly number-driven, finding ways to quantify your accomplishments should be relatively easy. But what about people who work in positions that aren't so easily quantified?"}
{"content": "Instead of adding numbers that don't relate to your core achievements just for the sake of data, try these strategies:"}
{"content": "Explain the scale of what you did. Did you tutor 12 children or organize an event with 400 attendees?\nMention the frequency of ongoing duties. Did you send a weekly newsletter, daily status reports, or reconcile a monthly budget?\nDescribe your time investment. Did you spend 10 hours per week volunteering at a shelter, or put in 60+ hour weeks in the leadup to a product launch?\nEstimate and make use of ranges. Nobody is going to meticulously check whether you saved your company 19% or 22% in overhead — just make sure whatever figure you use is approximately correct."}
{"content": "General tips Aim for bullet points to be 1-2 lines long. Start each bullet point with an action verb"}
{"content": "Include specific details and quantifiable results whenever possible. Tailor your bullet points to the job you’re applying for."}
{"content": "Remove any unnecessary words or jargon. Examples\nConcise and effective"}
{"content": "Managed a team of 10 engineers, leading to a 15% increase in project efficiency."}
{"content": "Developed and implemented a new marketing strategy that boosted sales by 25% within six months. Too long"}
{"content": "Was responsible for managing a team of 10 engineers and overseeing their daily tasks, which ultimately resulted in a 15% increase in project efficiency over a period of six months due to improved workflow processes and team collaboration."}
{"content": "Resume Writing Guide\nWelcome to the r/Resumes Resume Writing Guide! We've created this resource to help you navigate the often-confusing world of resume creation."}
{"content": "Remember, there's no single \"perfect\" resume. The ideal resume for you will depend on your unique background, the industry you're targeting, your level of experience, and your specific career goals. However, this guide is packed with best practices and tips that apply to many situations."}
{"content": "Think of this as your starting point. Use the information here as a foundation, and then tailor your resume to fit your individual needs."}
{"content": "Building a Professional-Looking Resume\nWhere to Begin?\nDon't feel overwhelmed if you're creating your first resume. There are plenty of resources to help you get started:"}
{"content": "Templates:"}
{"content": "Benefit: A great way to save time and ensure a clean, organized format. Countless templates are available online – choose one that's easy to read and edit."}
{"content": "Our Recommendation: Check out this simple and effective template to get you started. If you more options and flexibility (a paid option mind you), you can also try this."}
{"content": "A Word of Caution: Don't get too attached to any one template. No template is perfect for every situation. Use templates as a starting point and be prepared to adapt them based on feedback you receive in this subreddit."}
{"content": "Online Services: There are a ton of online services that can help you if you're stuck."}
{"content": "Resume Builders: Can help you create a resume with pre-written content and formatting options."}
{"content": "Resume Writers: Offer personalized assistance with crafting and editing your resume."}
{"content": "Important Note: Be cautious when using these services. Some may not be reputable and could produce subpar results. Always research any service thoroughly before using it. Check out this example of a cautionary tale to see why due diligence is important."}
{"content": "Remember: The most important aspect of your resume is the content. Focus on highlighting your skills, experience, and accomplishments in a clear and concise way."}
{"content": "What to do if you have little or no experience.\nContinue further down to the section titled 'Building and Formatting a Resume with Little to No Work Experience'."}
{"content": "Do I need a cover letter?\nThe role of cover letters in today's job market is a topic of debate. While some recruiters still value them, others may not have the time to read them, especially when dealing with a large volume of applications."}
{"content": "Here's the bottom line:"}
{"content": "Cover letters aren't always necessary: If a job posting doesn't specifically request a cover letter, you can often omit it."}
{"content": "When to include one: Always provide a cover letter if the job posting asks for one. Additionally, consider writing a cover letter if:"}
{"content": "You want to add context to your resume that doesn't fit within the resume format.\nYou're applying for a particularly competitive position.\nYou have a personal connection to the company or someone who works there.\nWriting a Strong Cover Letter:"}
{"content": "If you do write a cover letter, keep it concise and focused. Aim to achieve these three key goals:"}
{"content": "Introduce yourself: Briefly state your name and the position you're applying for.\nSummarize your background: Highlight relevant experience and skills that align with the job requirements.\nShowcase your value: Explain why you're the ideal candidate and what unique qualifications you bring to the table.\nAdditional Tips:"}
{"content": "Read the job posting carefully: Follow any specific instructions regarding cover letters.\nEmail Applications: If you're applying via email, the body of your email serves as a brief introduction, not a full cover letter. Attach your formatted cover letter as a separate document.\nSummary Section\nInstead of a traditional objective statement, consider using a resume summary or brand statement. This concise snapshot (aim for 60-100 words) serves as your elevator pitch, quickly conveying your value to potential employers."}
{"content": "Why a Resume Summary?"}
{"content": "Not always required: If you've included a cover letter, your summary might be redundant.\nValuable for quickly grabbing attention and highlighting your most relevant qualifications, as well as filling the gap if you're not submitting a cover letter.\nWriting an Effective Summary"}
{"content": "Focus on:"}
{"content": "Who you are and what you do: Clearly state your professional identity and area of expertise. Make sure this aligns with the job you're applying for."}
{"content": "Your achievements: Highlight your most impressive accomplishments that are relevant to the target role. Think about:"}
{"content": "Measurable results you've achieved (e.g., increased sales by X%, reduced costs by Y%).\nAwards, recognition, or promotions you've received.\nProblems you've solved or challenges you've overcome.\nTimes you've exceeded expectations or gone above and beyond.\nYour goal is to demonstrate that you're not only skilled and experienced, but that you have a proven track record of delivering results."}
{"content": "Work Experience\nThis is the section of your resume in which you detail your career history. It’s here that you demonstrate that you have the relevant skills, experience and background for the job you are applying for. This is typically the longest section on your resume."}
{"content": "How to describe your experience\nIncorporate bullets into your resume to improve skim value."}
{"content": "For present roles, write in the simple present tense (i.e., practices, manages, performs)"}
{"content": "For past activities, write in the simple past tense (i.e., achieved, managed, performed)."}
{"content": "Include context for the position: What kind of company do you work for? What kind of products or services do they offer? What kind of customers do they work with (i.e., businesses, individuals)? Which industry do they operate in? How large are they (i.e., 10 locations? 100 locations? 500 personnel?)."}
{"content": "Describe how your work supports the company and their bottom line (i.e., which products do you support? What kind of customers do you support? Which business unit do you work for?)"}
{"content": "What are your main functions? Don't worry about including every tiny detail - focus on the things that occupy most of your time and/or the things that are relevant to your next job."}
{"content": "Focus on how your work had an impact to the company's bottom line. This could take a variety of forms, such as:"}
{"content": "landing new clients,\nsaving on costs,\nautomating tasks and saving on manual hours,\nkilling your sales targets,\nearning performance-related awards or praise from management, or\nsuccessfully pulling off large-scale projects\nBullet Point Structuring"}
{"content": "PAR (Problem-Action-Result): A common and widely used formula that's ideal for showing accomplishments, highlighting technical skills, and demonstrating problem-solving abilities. Use it when you want to emphasize the impact of your work and how you achieved results."}
{"content": "Example #1: \"Reduced customer support response time by 20% by implementing a new ticketing system and optimizing workflow processes.\""}
{"content": "Example #2: \"Overcame tight project deadlines by prioritizing tasks, coordinating resources, and effectively communicating with stakeholders.\""}
{"content": "STAR (Situation-Task-Action-Result): This formula provides a more detailed narrative, making it suitable for behavioral interview questions and detailed job descriptions. It's great for demonstrating specific skills and competencies in context."}
{"content": "Example #1: \"Managed inventory levels and ensured product availability while minimizing stockouts in a fast paced retail setting; achieved a 15% reduction in inventory costs.\""}
{"content": "Example #2: \"Quickly diagnosed a server outage and implemented a temporary workaround, minimizing downtime for critical business operations and preventing thousands of dollars in associated losses.\""}
{"content": "Result-First: This formula leads with the quantifiable outcome, immediately grabbing the reader's attention. It's effective when you have impressive results to showcase and want to make a strong impact."}
{"content": "Example: \"Increased sales revenue by 18% through targeted marketing campaigns and effective sales strategies.\""}
{"content": "Action Verb + Skill + Result: Highlights the action taken, the skill applied, and the achieved result. It's concise and easy to read, and is commonly used for engineering/technical resumes."}
{"content": "Example: \"Developed a user-friendly website using HTML, CSS, and JavaScript, resulting in a 30% increase in website traffic.\""}
{"content": "Start with your most recent experience and continue in reverse chronological order. Your most recent role should also contain the most bullet points and the length of each section can decrease as you work back through your career."}
{"content": "Feature your most relevant bullet points first. For each job application, you should review what you have written so that you focus on the experience that is most relevant to the role you are applying for. Are there duties in the job description which you have performed in your previous roles? If so, make sure to include these examples at the top of each role in your experience section."}
{"content": "DON'T DO THIS Use generic statements. Use repetitive terms, phrases, or sentences."}
{"content": "Use overly fancy/flowery language. Simple is always better."}
{"content": "What should I do about gap years or employment gaps?\nGaps are something that a lot of job seekers struggle with. However, you always want to be transparent while protecting your privacy."}
{"content": "Recruiters these days understand that life happens. Whether it's illness, leave of absence due to burnout, or children, these things can sometimes get in the way of your professional life."}
{"content": "The key is to be honest about it. For example, if you took some time off due to illness and haven't worked since, simply include a line at the top of your experience section; where you'd normally list a job title, say something like \"Personal leave of absence\" along with the dates."}
{"content": "I have held two positions at one company, how can I best show this?\nThere are a few ways to handle this:"}
{"content": "If the roles are similar in scope (i.e., IT Specialist I and IT Specialist II) they can even be combined in a single title (IT Specialist)."}
{"content": "If the positions have some overlap, but are not exactly the same, choose the position name that you spent the most time as, that best reflects your qualifications, or that is simply the most relevant to your next job. You could even add a bullet that says something to the effect of \"Promoted internally from sales associate to head of sales after three years\"."}
{"content": "If the positions are entirely exclusive, list them as though you would list positions at different companies."}
{"content": "The key here is to remain truthful while maintaining a certain level of simplicity. Never list a title that you didn't hold or that reflects responsibilities you didn't have (i.e., listing yourself as a team leader when you haven't actually led anyone)."}
{"content": "I have multiple non-consecutive terms or discontinuous work in one position, how can I best show this?\nIf your work time is longer than the off-time, it can be ignored in favour of a single time range, using the typical start and end month/year."}
{"content": "If you worked at a summer camp for four summers, a span of 3.5 years may not be the most representative of the time you were working. Instead, using \"Summers 2010/11/12/13\" is appropriate. If your discontinuous time slots are not so easily summed up, just remember that clarity takes precedence over accuracy, as long as you are not stretching the truth in your favour."}
{"content": "Skills and Keywords\nKeywords are words or phrases found in the job posting and are important skills or competencies required to fulfill the role. Including them on your resume will enable you to rank higher in a recruiter search. This doesn't guarantee you'll get the job or the interview, but it will increase the likelihood that your resume will be seen first."}
{"content": "Here are two great articles on ATS: Beating ATS Understanding ATS"}
{"content": "Technical Skills\nTechnical skills on a resume showcase specific knowledge and expertise in using tools, software, hardware, or specialized processes within a particular field. They demonstrate your ability to perform job-specific tasks and are crucial for many positions, especially those in technology, engineering, science, and other technical fields."}
{"content": "There are different types of technical skills, which can be broadly categorized as:"}
{"content": "Hard Technical Skills: These involve hands-on, practical knowledge of specific tools, software, hardware, or techniques. Examples include:"}
{"content": "Programming languages: Java, Python, C++, JavaScript, etc.\nSoftware applications: Microsoft Office Suite, Adobe Creative Suite, CAD software, project management software, etc.\nOperating systems: Windows, macOS, Linux\nData analysis tools: SQL, R, SAS\nNetworking protocols: TCP/IP, DNS, DHCP\nCloud computing platforms: AWS, Azure, Google Cloud\nSpecific technical processes: Machine learning, statistical analysis, web development\nSoft Technical Skills: These skills involve using technical knowledge to solve problems, analyze data, communicate effectively, and collaborate with others. Examples include:"}
{"content": "Troubleshooting: Identifying and resolving technical issues\nData analysis: Collecting, processing, and interpreting data\nProject management: Planning, organizing, and executing technical projects\nTechnical writing: Creating clear and concise technical documentation\nPresentation skills: Communicating technical information effectively to both technical and non-technical audiences\nWhen incorporating technical skills into resume bullet points, a common and effective structure to follow is the PAR (Problem-Action-Result) method:"}
{"content": "Problem (or Project): Briefly describe the challenge, project, or task you faced. This sets the context for your technical skill application.\nAction: Explain the specific actions you took to address the problem or complete the task. Highlight the technical skills you used and how you applied them.\nResult: Quantify the positive outcome or impact of your actions. Emphasize the results achieved through your technical skills, using numbers or percentages if possible.\nHere's an example of a PAR bullet point showcasing technical skills:"}
{"content": "Problem: Website traffic was declining due to slow page load times and poor user experience.\nAction: Implemented website optimization techniques, including image compression, code minification, and caching, using HTML, CSS, and JavaScript. Improved site navigation and mobile responsiveness.\nResult: Increased website traffic by 25% within three months, decreased page load time by 50%, and improved user engagement metrics by 15%.\nThis structure effectively demonstrates your technical skills in a context that's meaningful to employers. It shows not only that you possess certain skills but also how you have successfully applied them to achieve tangible results."}
{"content": "What about soft interpersonal skills?\nWhat are soft skills? They are terms that describe character traits, such as:"}
{"content": "Problem-solving\nOutgoing communicator\nCritical thinker\nDriven\nThe problem with these terms is that they are so over-used that they have lost all value. Anybody can say that are \"driven\", but few can prove it. Accordingly, it's best to leave these skills off of your resume. They will be implied through well-written descriptions of your responsibilities and accomplishments."}
{"content": "Ideally, your bullet points will highlight quantifiable achievements as opposed to responsibilities. That means specific accomplishments with metrics to back them up. It is more effective to tell the reader how you have impacted the company and how you have added value. Instead of saying \"I have excellent communication skills,\" say \"Presented quarterly performance updates to internal stakeholders,\" in order to demonstrate it."}
{"content": "Should I evaluate my skill levels?\nUnless you hold a skill or certification that has levels prescribed through a conventional standard (i.e., such as through a governing body), it's best not to provide a self-evaluation. If you include a skill on your resume, the assumption is that you have at least a working knowledge of that skill such that you could employ it in a professional setting. If you don't meet this requirement, it's best not to include it."}
{"content": "Education\nThis section will vary greatly from individual to individual according to your level of qualification and its relevance to the jobs you are applying to. If your education is very relevant for the job you are applying to then it should be featured on the first page of your resume above your experience section."}
{"content": "Your education would normally be considered relevant if it is within the same field for which you are working. For example, a Finance Degree for an accounting role or an MBA for a Management Consultancy position. It would also be considered relevant if you're a recent graduate with limited work experience, as it shows your ability to learn and demonstrates your level of training and knowledge."}
{"content": "However, if you did not achieve a high level of education, did not study in any particular field, or you left school or university more than ten years’ ago, then your experience is probably going to be much more relevant than your education. In this case, add your education section below the experience section."}
{"content": "Should I include my GPA?\nThe general rule is never if under 3.0 and always if over 3.5. If you've been out of school for a year or more and you are already working in your field, your GPA is probably not important enough to be included on your resume at all."}
{"content": "Many countries (notably the UK) do not employ the concept of a GPA, preferring rather to represent the general academic accomplishment with degree modifiers such as \"Upper Second-Class Honours\"."}
{"content": "Interests/hobbies\nMost of the time, an interests or hobbies section is not needed, simply because there are more pertinent things you could include in its place. The other reason is that most of the time, people don't include anything interesting at all or worth mentioning."}
{"content": "For example, most resume interest sections go something like this: \"Reading, running, swimming, coding, research\"."}
{"content": "Not only is this uninteresting, but it's a complete waste of space. If you're going to include this section, at the very least make it specific (i.e., reading WWII history)."}
{"content": "References\nDon't include references or “references available upon request” on your resume. Do bring a reference sheet to any interviews so that you can provide them should they be requested."}
{"content": "Resume Length\nYou want to make sure your resume is only as long as it absolutely needs to be. The goal of a resume is to pique readers’ interests, establish qualifications and create some curiosity that will lead to an interview. For most people, one or two pages is sufficient. There are exceptions to this:"}
{"content": "For professionals in IT, cybersecurity, software engineering, or government roles, it's not uncommon to use two to three page resumes."}
{"content": "For senior executives with an extensive career history, three page resumes are acceptable."}
{"content": "For professionals in academia, an academic cv is the standard and can range between five and twelve pages in length."}
{"content": "Submitting a resume\nHow many resumes should I send out, and how much time should I spend on each one?\nIn today's economy, it is not uncommon to send out 20 resumes before receiving a call back. Each resume should be targeted toward the industry and position to which you are applying. That will mean that you have several variants of your resume. Every cover letter should also be targeted toward the specific position AND the company."}
{"content": "You've probably heard the adage of \"Until you find a job, finding a job is your full-time job\". It is up to you and your situation how much time you can and should put in to your job search."}
{"content": "However, another crucial decision is how to balance quality and quantity. You can send out 50 identical resumes or four tailored ones. Contrary to popular advice, the answer is not always clear, and as a new grad, it can be hard to know what exactly you can change in a resume to reflect a specific job."}
{"content": "However, it is generally recommended that you produce a few variants to cover your bases in the following categories:"}
{"content": "Industry - You may be a programmer with a background in many languages, but if you are going into web applications, you don't need to outline your past C++ projects."}
{"content": "Company Size - Smaller companies may be more interested in you as a person rather than as an employee. Also, smaller companies will often skip the hiring manager and put your resume right into the hands of your prospective boss, meaning your resume can have more technical lingo."}
{"content": "Country - If you are applying internationally, it can be useful to state your work permit eligibility."}
{"content": "The most important thing is to put enough time into the resume variants and the cover letters to make sure there are no mistakes."}
{"content": "Copy-pasting can result in a Dear Sir letter forwarded to Sarah Smith or a wrong company name. That is a death sentence. As a teenager, spend 30+ minutes on an application. As a university student, 1+ hours. As a new graduate, 1-2 hours. As a specialist, 2-4 hours. Everything you put in, you will get out."}
{"content": "Sending PDF or Word Doc?\nMost ATS are compatible with both and in some job advertisements, the employer will specify which format to be used. However, some evidence suggests that a majority of ATS are more compatible with Word documents rather than PDF."}
{"content": "Note: PDF resumes created in Adobe InDesign, Overleaf LaTeX, or Canva have been shown to not do as well with a lot of applicant tracking systems (ATS). If you plan on using one of these applications to build your resume, do so at your own risk."}
{"content": "Should my cover letter just be the body of an email?\nThe body of your email is not your cover letter and if one is requested, you still need to provide it on a separate letterhead (i.e., as a stand alone document)."}
{"content": "Should the cover letter and resume be combined in one document?\nTreat the two as separate documents unless otherwise instructed in the job advertisement."}
{"content": "Building and Formatting a Resume With Little to No Work Experience\nEducation\nAs a student or recent graduate, your education section becomes the cornerstone of your resume. While experienced professionals typically place education below their work history, you'll want to lead with it. This immediately shows recruiters you're building relevant knowledge in your field."}
{"content": "Make your coursework count by being selective. Instead of listing every class you've taken, highlight 3-4 courses that directly relate to the job you're targeting. For example, if you're applying for a marketing internship, courses like Digital Marketing, Consumer Behavior, and Marketing Analytics deserve emphasis."}
{"content": "For academic projects, focus on outcomes and real-world applications:"}
{"content": "Rather than \"Completed final project in Business Strategy,\" write \"Developed comprehensive growth strategy for local business, which contributed to a 20% projected revenue increase\""}
{"content": "Instead of \"Group project in Software Engineering,\" try \"Led 4-person team to create inventory management system using Python and SQL\""}
{"content": "Remember: GPA is optional unless it's above 3.5 or specifically requested. Academic honors, dean's list appearances, and relevant scholarships all deserve mention, but keep descriptions brief and impactful."}
{"content": "Skills\nYour skills section is where classroom learning transforms into workplace capabilities. For entry-level positions, recruiters often scan this section first to see if you have the basic technical foundation they need."}
{"content": "Create clear categories for your skills to make them easily scannable. Common groupings include:"}
{"content": "Technical Skills (software, programming languages, specialized tools)\nLanguage Proficiencies (with accurate fluency levels)\nLaboratory/Research Techniques (for STEM fields)\nIndustry-Specific Tools (like design software or accounting systems)\nShould you list skill levels?"}
{"content": "You don't need to list skill levels in the skills section; instead, show how you used said skills in the work experience or projects sections."}
{"content": "Created 3 full-stack applications using React\nCompleted 5 data analysis projects using R\nDesigned marketing materials for student organizations using Adobe Creative Suite\nAvoid listing basic software like Microsoft Word unless specifically requested in the job posting. Focus instead on specialized tools and skills that differentiate you. And remember: anything you list is fair game for interview questions, so be prepared to demonstrate your capabilities."}
{"content": "Projects & Portfolio\nFor those with limited work experience, your projects section becomes your proof of capability. While experienced professionals show their work history, you'll use projects to demonstrate your ability to apply knowledge, solve problems, and deliver results."}
{"content": "Every project on your resume should tell a clear story of what you accomplished and how it made a difference. The most effective project descriptions follow a simple formula: What you built + How you built it + The impact or outcome."}
{"content": "Example: Instead of Created a website for local business Say this..."}
{"content": "Developed responsive e-commerce site using React and Node.js, resulting in 200+ online orders in first month."}
{"content": "When describing group projects, show your involvement while acknowledging teamwork. Examples:"}
{"content": "Led 3-person team in developing inventory management system, coordinating weekly sprints and client communication\nManaged front-end development within 5-person project team, delivering all components on schedule\nCoordinated with 4 team members to research and present market expansion strategy for local startup\nDocumentation matters as much as the project itself. Include links to:"}
{"content": "GitHub repositories with clean, well-commented code\nLive websites or applications\nProject documentation and technical write-ups\nResearch posters or presentations\nProcess blogs or case studies\nSelecting which projects to include requires strategy. Prioritize:"}
{"content": "Projects that align with your target industry or role\nWork that demonstrates relevant skills\nProjects with measurable outcomes or impact\nCollaborative work that shows your ability to work within a team\nSelf-directed projects that show your ability to work independently\nFor technical roles, include project details:"}
{"content": "Technologies and languages used\nScale and complexity (users, data volume, features)\nTechnical challenges overcome\nPerformance improvements achieved\nRemember: Quality beats quantity. Three well-described, relevant projects are more valuable than a long list of minor assignments. Each project should earn its place on your resume by clearly demonstrating skills relevant to your target role."}
{"content": "Experience Alternatives\nWhen traditional work experience is limited, your challenge is to show other activities that demonstrate professional capabilities. The important thing is presenting these experiences in a way that highlights transferable skills and measurable impact."}
{"content": "Examples:\nThe way you present your extracurricular activities makes a big difference. Below are some examples for how you can present various activities you may be involved in."}
{"content": "Leadership in Student Organizations"}
{"content": "Instead of \"Member of Marketing Club,\" write \"Led 5-person team to increase club membership by 40% through targeted social media campaigns\nRather than \"Spanish Club Secretary,\" use \"Managed $5,000 annual budget and coordinated 12 cultural events for 200+ members\nReplace \"Chess Club Member\" with \"Organized weekly tournaments for 30+ participants and maintained club's ranking system\nVolunteer Work"}
{"content": "Developed and implemented new donor tracking system for local food bank, improving follow-up response rate by 25%\nTrained 15 new volunteers on shelter procedures and animal handling protocols\nCreated social media content strategy that increased donation engagement by 35%\nAcademic Research Experience - Unpaid"}
{"content": "Assisted professor with data collection and analysis for published study on consumer behavior\nMaintained detailed laboratory records and protocols for 3 concurrent research projects\nCollaborated with 4-person research team to develop survey methodology reaching 500+ participants\nPart-time Work Reframed"}
{"content": "Instead of \"Made coffee and served customers,\" write \"Maintained 98% customer satisfaction while processing 200+ transactions during peak hours\"\nReplace \"Stocked shelves\" with \"Managed inventory rotation system for $50,000 worth of perishable goods\"\nTransform \"Answered phones\" to \"Resolved 40+ customer inquiries daily while maintaining detailed call logs\"\nThe goal isn't to pad your resume but to authentically present your experiences in professional terms. Focus on responsibilities that demonstrate initiative, reliability, and measurable results."}
{"content": "How you present your content matters\nThe difference between a forgettable resume and one that lands interviews often comes down to how you describe your experiences. Turn basic task descriptions into achievement statements that showcase your impact."}
{"content": "Start every bullet point with a strong action verb that captures what you actually accomplished:"}
{"content": "Instead of \"Helped with...\" use \"Initiated,\" \"Led,\" \"Created,\" \"Developed\"\nReplace \"Was responsible for...\" with \"Managed,\" \"Coordinated,\" \"Implemented\"\nTransform \"Worked on...\" to \"Delivered,\" \"Executed,\" \"Streamlined\"\nQuantify wherever possible, even if the numbers are small:"}
{"content": "Increased Instagram engagement by 25% through consistent content strategy\nReduced processing time by 15% by automating data entry tasks\nManaged study group of 12 students, improving average test scores by 18%\nWhen you can't find specific numbers, focus on scope and scale:"}
{"content": "Coordinated logistics for three campus-wide events\nCollaborated with teams across five departments\nMaintained detailed documentation used by entire 20-person organization\nEven without formal work experience, you can show value by being specific and detailed in how you describe your work."}
{"content": "John Smith\nemail@gmail.com ❖ (555) 555-5555 ❖ Edmonton, AB WORK EXPERIENCE"}
{"content": "Top Company \t\t\t\t\t\t\t\t\t          \t   Oct. 2017 – Present\nFounder & CEO\t\t\t\t\t\t\t\t\t\t     \t       Denver, CO\nAs Founder & CEO, I oversee our core strategies, product roadmap, ops, marketing, and fundraising.\nTens of thousands of units sold in 2 years of operation with thousands of 5-star reviews.\nSub-bullets are for more detail if needed, like key performance stats or a portfolio / website link. \nCore responsibility #3. Pretend this is where they stop reading your resume. Whether Work or Education is your top section, the first 3 things they see better be your most impressive stuff, period.\nCore responsibility #4. Bullets #1 and #2 are for high-level descriptions of the company and/or your role.\nAchievement #1: Challenge/Action/Result\nAchievement #2: Challenge/Action/Result\n \nCompany Name\t\t\t\t\t\t\t\t\t   Month Year – Month Year\nJob Title\t\t\t\t\t\t\t\t\t\t\t\t     \t      \tCity, ST\nCore responsibility #1.\nCore responsibility #2.\nAchievement #1: Challenge/Action/Result\nAchievement #2: Challenge/Action/Result"}
{"content": "Company Name\t\t\t\t\t\t\t\t\t   Month Year – Month Year\nJob Title\t\t\t\t\t\t\t\t\t\t\t\t     \t       \tCity, ST\nCore responsibility #1.\nCore responsibility #2.\nAchievement #1: Challenge/Action/Result\nAchievement #2: Challenge/Action/Result"}
{"content": "EDUCATION \n\t\nUniversity Name \t\t\t\t\t                     \t        \t\t      Graduation Month, Year \nDegree (e.g., BS), Majors (e.g., Computer Science)\t\t\t\t\t   \t\t\t            City, ST\nList your honors like summa cum laude or Economics Honors Society; 3.X/4.0 GPA (list only if GPA is over 3.3)\nStudied abroad in City, Country during spring/fall 20YY semester (University Name)\nAny other fun stuff like varsity sports, fraternity/sorority, or something that gives you a little color"}
{"content": "SKILLS"}
{"content": "Strategic planning; strategic partnerships; revenue modeling & forecasting; retail partnerships, sales, & distro; contract negotiations; account management; Amazon marketing; channel marketing; crowdfunding; copywriting; content marketing; brand marketing; DTC; Shopify; supply chain management; Keynote / PPT presentation"}
{"content": ""}
{"content": "Quantifying your performance on a resume is an effective way to demonstrate your value and highlight your accomplishments in prior positions. In a competitive job market, it is important to make sure that you are giving yourself every available advantage. A resume with quantified accomplishments leaves a strong impression on the hiring professional who reads it. In this article, we discuss how to effectively quantify accomplishments on a resume, the benefits of doing so and examples that compare quantified and unquantified resumes.\nWhy is it important to know how to quantify on a resume?\nA strong resume with an effective cover letter is an essential part of applying for a competitive job listing. One of the best ways to make your resume more memorable and effective is to include specific numbers when listing your accomplishment or prior experience, as opposed to describing them using vague terms. When you quantify your resume, you read through it to identify areas where you can use more precise numbers that offer a clearer representation of the value that you provide.\nRead more: 4 Examples of Key Performance Metrics to Track\nThe benefits of quantifying your accomplishments on a resume\nAdding numbers into your resume is one of the simplest and most effective ways to make it more memorable and impressive. Reasons to include precise quantities whenever possible include:\nQuantifying your performance provides specificity for the hiring professional who is reading your resume. A phrase such as \"significantly increased new client acquisition\" can mean a broad range of performance results to a broad range of readers, whereas a direct quantity such as \"oversaw a 37% growth in new client acquisition\" states precisely how effective your work was.\nProviding numbers makes your claims on the resume more credible. Using precise quantities implies that you have the data to back up your claims, which means that you are not embellishing.\nUsing quantities on your resume demonstrates that you are results-oriented. Rather than focusing on abstract concepts, presenting the bottom-line results of your prior experience allows those results to represent your priorities and performance.\nNumbers help your resume to stick in the mind of the hiring professional. Often for competitive positions, there will be several rounds of assessment in which the field of potential hires is narrowed down. Specific quantities separate your resume from comparable applicants', improving your chances of being moved on to the next phase of the hiring process.\nRead more: How to Write Strong Bullet Points for Your Resume\nHow to quantify accomplishments on a resume\nWhen you quantify your resume, you should make sure that you use numbers as effectively as possible by following these steps:\n1. Track your work\nThe more data you have on your performance at prior jobs, the better situated you will be to identify the metrics that present you in as favorable a light as possible. While it is possible to organize your data after the fact when you are searching for new work, the best way to prepare yourself is to keep your performance data updated as you go.\nMake a habit of tracking some of the most important metrics of your job performance. Not only does this make it so that you do not have to spend valuable job search time compiling all of your old data, but it also helps you perform better by allowing you to see where you are excelling and where your performance could be improved. It's an effective way to determine if any changes you have implemented are having the desired results.\n2. Gather your data\nIf you haven't kept records of your performance data prior to starting work on your resume for a job search or promotion application, that doesn't mean you can't still use quantities to improve your resume.\nIf you find that you have a lack of usable data and need to gather all of your data during the job search, you may need to prioritize which metrics you devote time to compiling data on. Think about both the areas that will be most applicable to the position you are applying for and the metrics where you performed the best and start by compiling the information you need to quantify them, then proceed to other areas as time permits.\n3. Make use of ranges\nWhile specificity is valuable on a resume, sometimes you won't always have access to precise numbers. Whether the lack of precision is because you do not have the data you need to give an exact number or because there was variance in the underlying data, a range is an effective way to communicate the data without being overly specific. For example, a personal trainer may describe their work at a prior gym by saying they served 15 to 20 clients every week in order to give an impression of their client load while acknowledging it could vary from week to week.\n4. Focus on key metrics\nProviding numbers helps to make your claims less ambiguous, but they are most effective when used to focus on key metrics that appeal to hiring professionals, such as:\nMoney: Financial numbers are essential for any successful company, and that means they are always a valuable addition on your resume. If you can demonstrate improved financial performance, such as citing an increase in sales or net profits, you should do so by including the specific dollar amount you have generated.\nPeople: Depending on the position you are applying for, you can quantify everything from the number of clients you had to the size of the staff working under you.\nTime: Experience is highly valued in the professional world, so you should always use specific numbers when possible to demonstrate the length of your professional experience.\nRankings: Many industries make use of ranks, and you should include them in your resume if possible. For example, a search engine optimization professional could include that they helped improve a client from the fourth page of search results to the top-ranking position for targeted keywords.\n5. Double-check your work\nWhen including quantities on your resume, double-check that they are correct before you send your resume out to employers. It's important to present the most accurate information possible to remain honest during the hiring process.\nExamples of quantifying resume accomplishments\nUsing numbers on your resume is an effective technique across a broad range of industries and careers. These examples can help show you how to quantify a resume no matter what your chosen career is:\nExample 1: Education\nUnquantified: Helped students to improve their standardized testing scores in order to raise their college application prospects.\nQuantified: Developed and implemented an AP Calculus curriculum that resulted in a 4.3 average on AP testing and a 92% success rate.\nExample 2: Human resources\nUnquantified: Coordinated payroll, benefits and conflict resolution for a large staff while maintaining high company morale.\nQuantified: Oversaw human resources staff of seven employees serving an office of 450 staff members, maintaining strong staff relationships to aid in retention and production.\nExample 3: Management\nUnquantified: Created policies to improve staff performance across all divisions, resulting in increased profits from year to year.\nQuantified: Led a staff of 20 employees with innovative policies that yielded a 27% increase in profits from the previous calendar year.\nExample 4: Marketing professional\nUnquantified: Developed an online marketing platform to improve organic search traffic results and increase client acquisition numbers.\nQuantified: Developed an innovative online marketing platform that produced top-three results on all targeted keywords, yielding a 48% increase in organic search traffic and $17,000 of increased sales.\nExample 5: Sales associate\nUnquantified: Created bonds with clients to develop lasting relationships, resulting in significant sales performances in every quarter.\nQuantified: Developed strong bonds with clients resulting in long-lasting relationships and the title of #1 Sales Associate in the Northeast and #3 Sales Associate Nationwide."}
{"content": ""}
{"content": "Do’s & Don’ts of Resume Writing\nDo’s\nDetermine your job search objective prior to writing the resume and tailor your resume for the position.\nCustomize your resume to match a specific job description. Use buzzwords from the industry.\nFocus on positive results and accomplishments.\nKeep a consistent, easily-readable format.\nCreate strong, action-oriented statements about your work.\nList the most important, relevant items first. For example, you may decide to move your “Internships” and “Projects” sections above your “Customer Service Experience” section. Underneath each experience, you should also put the most important bullet points first.\nWithin each section, you must list experiences in reverse chronological order, starting with the most recent.\nQualify and quantify your experiences whenever possible. Include numbers and percentages when possible.\nHighlight specific accomplishments rather than expand on every detail.\nExpand on professional, volunteer, research, and classroom experiences to show transferable skills.\nProofread your work. Ask the Career Center, friends, and advisors for help.\nDon’ts\nUse templates and tables included in software.\nMake general claims (“Good communication skills”) without backing them up with examples.\nMislead employers about your GPA, skills, or abilities.\nInclude long, generic objective statements. Employers won’t read them!\nSubmit references on the same page as your resume. They should be kept in a separate document and provided when the employer asks for them.\nDon’t go over two pages. Most underclassman candidates should have a one-page resume, but this will depend on the amount of experience you have.\nPut all your eggs in one basket. Apply to multiple positions that match your career interests."}
{"content": ""}
{"content": "Google Recruiters Say Using the X-Y-Z Formula on Your Resume Will Improve Your Odds of Getting Hired at GoogleAlternative: Reverse engineer their advice and improve recruitment at your business."}
{"content": "EXPERT OPINION BY BILL MURPHY JR., FOUNDER OF UNDERSTANDABLY AND CONTRIBUTING EDITOR, INC. @BILLMURPHYJR SEP 13, 2019SHARE"}
{"content": "LINKEDIN FACEBOOK X BLUESKY LINK Getty Images"}
{"content": "More than two million people apply to work for Google each year, which is more than 20 times the number of employees at the company at any given time."}
{"content": "With that kind of volume, it makes sense that Google proactively tries to tell applicants what they should do to improve their odds of getting noticed within the herd."}
{"content": "Among its tools are a series of YouTube videos and articles detailing best practices for resumes (embedded below, along with two articles by Google’s former senior vice president of personnel operations)."}
{"content": "Here are some of the most important resume tips the company offers, including the simple, three-part formula that Google says applicants should always use. Even if you’re not eager to work at Google, reverse engineering their expectations could give you some smart ideas regarding how to ask candidates to apply for opportunities with your business."}
{"content": "1. Basic formatting"}
{"content": "Google rarely requests or even looks at a cover letter, so there is a lot riding on resumes. At the outset, the key rule is to keep things simple when it comes to format, and ensure that your resume is highly readable. That includes things like:"}
{"content": "Formatting your resume as a pdf. This seems like a no-brainer in 2019, but Google’s guides repeat this advice several times, so we have to assume not everyone does this automatically."}
{"content": "Skipping the objective. (They know what your objective is: to land this particular job.)"}
{"content": "Using black text, and keep the font and size clean, simple, and consistent."}
{"content": "Checking for typos. This is so important, we’ll say it again: Check for typos."}
{"content": "Using bullet points. (How’s this for meta advice, since you’re reading it in a bullet point?) Don’t include long lines of descriptive text. Put yourself in the place of a human resume-reviewer, who is likely reading dozens of resumes at a time."}
{"content": "Making sure you include your contact info. Yes, this seems obvious — but make sure your name and email address are prominent. If you’re applying for technical positions, include your Github link (more on that below)."}
{"content": "2. Customization"}
{"content": "You should write a new, tailored resume for every position you apply for. Also, the Google recruiters advise keeping it under a single page."}
{"content": "The exception to this is that if you are applying for a technical or engineering position, you can legitimately have a large number of relevant projects to list, and that might take you to a second page."}
{"content": "But for almost any other type of position, one page is the rule."}
{"content": "This also means that you have to be a ruthless editor. If you have tons of relative experience, you’ll want to describe it all as succinctly as possible, while still getting your message across."}
{"content": "One specific piece of advice is that if any bullet point on your resume spills over by a word or two into a second line, figure out a way to write it shorter, so it stays on one line. Space is at a premium with a suggested one-page maximum."}
{"content": "3. Use the X by Y by Z formula"}
{"content": "This is the crux of the advice by Laszlo Bock, a former Google senior vice president of personnel operations. You want to adhere to the bullet-point format as we’ve discussed, and articulate your experience in this specific way."}
{"content": "Google describes this as: “Accomplished [X] as measured by [Y], by doing [Z].” But just to make it easier to remember, let’s shorten it to X-Y-Z."}
{"content": "This means that you want to focus on accomplishments — quantitative results and the impact that you had as a result. It’s probably easiest to explain this by using a few examples from the Google recruiters’ YouTube videos themselves."}
{"content": "For example, imagine an applicant who wants to make clear that he or she is a member of a prestigious group. Here’s the OK way, the better way, and the best way to describe this on a resume, according to Google:"}
{"content": "OK: “Member of Leadership for Tomorrow Society”"}
{"content": "Better: “Selected as one of 275 for this 12-month professional development program for high-achieving diverse talent.”"}
{"content": "Best: “Selected as one of 275 participants nationwide for this 12-month professional development program for high-achieving diverse talent based on leadership potential and academic success.”"}
{"content": "Here’s another example, this one for a technical position in which the applicant wants to point out that he or she placed second in a hackathon."}
{"content": "OK: “Won second place in hackathon.” Better: “Won second place out of 50 teams in hackathon.”"}
{"content": "Best: “Won second place out of 50 teams in hackathon at NJ Tech by working with two colleagues to develop an app that synchronizes mobile calendars."}
{"content": "(In this case, the last, “best” is my own interpretation; Google doesn’t actually provide the third suggestion. But I hope the point is clear.)"}
{"content": "Here’s a final example, intended for a business applicant who wants to show how much he or she contributed in a client support role:"}
{"content": "OK: “Grew revenue for small and medium business clients.”"}
{"content": "Better: “Grew revenue for small and medium business clients by 10% QoQ”"}
{"content": "Best: “Grew revenue for 15 small and medium business clients by 10% QoQ by mapping new software features as solutions to their business goals.”"}
{"content": "One point about jargon: Use shorthand like “QoQ” (for quarter over quarter) only if you’re 100 percent sure that the resume reviewer will know exactly what you mean."}
{"content": "4. Advanced formatting"}
{"content": "Beyond the basic formatting issues, like keeping it to one page and using bullet points, there are some slightly more advanced formatting issues to consider."}
{"content": "You want to be sure to organize things in the same way that recruiters and reviewers are used to seeing them. The rules include:"}
{"content": "education before experience if you’re a student or a relatively recent graduate, or"}
{"content": "experience before education (in reverse chronological order), if you’ve been in the workforce for more than a position or two."}
{"content": "For recent graduates, Google insists on school, degree, major, GPA, and month and year of graduation. But the further away you are from college, the less college and university information you’re expected to include."}
{"content": "“Generally the more recently you attended university, the more detail you should include here,” Google technical recruiter Jeremy Ong says in one of the videos."}
{"content": "The one caveat here, and frankly it’s not something that Google addresses, is how to handle year of graduation if you’re an older applicant."}
{"content": "There’s a point at which Google probably doesn’t want to know your age, so as to reduce the odds of ever having to defend against an age discrimination claim. Obviously putting on your resume that you graduated from college in 1990 suggests you’re well over 40."}
{"content": "Beyond that, however, focus on things that are most relevant for the position, and don’t be afraid to cut older positions and achievements, especially if they’re not relevant."}
{"content": "If you have a lengthy work history that would push you beyond the one-page suggested maximum length, you might add a short, additional section mentioning that you have other, less relevant experience, without going into great detail."}
{"content": "5. For technical applicants"}
{"content": "If you’re applying for technical or engineering jobs, there are a couple of additional pieces of advice."}
{"content": "The first is to include your Github link, or equivalent, at the top with your contact information. (Ironic, since Microsoft has owned Github since last year.)"}
{"content": "Additionally, the recruiters want to see your programming languages listed prominently. And as you list projects and experience — either in a separate section or as part of your employment history — include programming languages you used for each project."}
{"content": "Obviously, this is all for step one in the recruiting process — the resume and application — and Google has other videos on later-stage items like how to prepare for specific types of interviews."}
{"content": "But even as someone who isn’t likely to apply for a job with Google or any other company anytime soon, I found it helpful in terms of the information to ask for when recruiting and interviewing."}
{"content": "Practical guide to writing FAANG-ready software engineer resumes"}
{"content": "👋 Hi there, I'm Yangshun, an ex-Meta Staff Engineer, author of this handbook and Blind 75. Follow me on LinkedIn for Software Engineering advice and interview tips!"}
{"content": "Not sure why you're still not getting shortlisted at some or all of the top tech companies? Your software engineer resume could be the issue."}
{"content": "Having read tons of software engineering resumes as a FAANG interviewer, even some of the most qualified candidates I know fail to get shortlisted due to bad resumes. The mistake most people make is to immediately assume that they weren't qualified enough - but that could be far from the truth."}
{"content": "Thankfully, there are specific steps and requirements you can fulfill to write a good software engineer resume. From your resume structure, content, to free tools you can use to test your resume, I have collated a very concise summary of the best practices to prepare your resume for a FAANG software engineering job application:"}
{"content": "Set up an ATS-friendly resume template Fill up your template with well-framed content in a meaningful order"}
{"content": "Optimize your resume with prioritization and keywords Test out resume using free tools"}
{"content": "How to set up an ATS-friendly software engineer resume​"}
{"content": "Something most candidates may not realize is that most top tech companies are using some form of Applicant Tracking Systems (ATS) to parse and screen thousands of resumes even before they reach human eyes. In many companies, the ATS may even use certain rules to reject candidates automatically."}
{"content": "While different companies could be using different types of ATS, it is possible to ensure that your software engineer resume is read favorably by most ATS. This section ensures your resume is at least perfectly readable by the ATS, while the next few sections improve your chances of passing ATS screenings."}
{"content": "Expert tip FAANG Tech Leads is currently offering resume templates and examples at 70% off. Their templates:"}
{"content": "Are created by ex-FAANG hiring managers based on top resumes received from hundreds of candidate applications"}
{"content": "Guarantee readability by FAANG ATS Cater to various experience levels"}
{"content": "They also offer resume examples/references from candidates who have received multiple offers from FAANG companies - which are helpful in helping you craft content that meets the same bar. Check it out!"}
{"content": "Only use Microsoft Word or Google Docs to create and edit your resume​ Do's"}
{"content": "Submit your resume as a PDF file to preserve formatting, but always create it from Microsoft Word or Google Docs. It is important to ensure that the text in your resume is easily highlightable, which is a precondition for easy parsing."}
{"content": "ATS tools are always trying to improve their readability of standard resume formats - hence the more commonplace your resume format is, the better."}
{"content": "To maximize space on your resume, rather than using header or footers, reduce the margins of the page - narrow margins are 0.5 on each side."}
{"content": "Don'ts Do not use Photoshop, other graphic design tools or online resume builders to build your resume"}
{"content": "Do not use the header or footer sections in a Word/Google Docs file - reduce margins instead and just write the information in the body."}
{"content": "Only use standard fonts of readable sizes​"}
{"content": "New fonts may convert letters into special characters which are not readable by the ATS. Fonts you should use - Arial, Calibri, Garamond."}
{"content": "Ensure your font size remains readable for humans later on in the hiring process - use a minimum size of 10px for readability."}
{"content": "Add sections with standard headings and ordering​"}
{"content": "ATS readers need to identify and parse standard types of information from your resume. Using standard header titles and ordering can help them do that better."}
{"content": "This is the order which has worked well for me and recommended by recruiters:"}
{"content": "SectionHeading NameProfessional summary(Use resume headline as section title, for e.g. \"Senior Software Engineer at Google with over 5 years of experience leading teams\")Contact information\"Contact Information\"Skills - programming languages, frameworks, etc.\"Skills\"Experience\"Work Experience\"Education (Note: if you are still in school or have less than 3 years of experience, you may put Education first)\"Education\"Projects\"Projects\"Other optional sections - e.g. Certifications, Awards, etc\"Awards and Accolades\" / \"Certifications\" / \"Awards, Accolades and Certifications\""}
{"content": "caution Never add symbols to your headers to avoid ATS readability issues. Get your resume reviewed for free"}
{"content": "Try out our free new community-powered resume review portal. Upload a resume, receive helpful comments and feedback from community members."}
{"content": "How to write good Software Engineer resume content​"}
{"content": "As software engineering is inherently different from other careers in terms of its required skills and experiences, the content expectations for a software engineer resume is also unique. Each of the following paragraphs will cover the content usually expected for software engineers within each resume section:"}
{"content": "How to write a professional summary for a software engineer​"}
{"content": "A good professional summary can be a game changer. Not only does it summarize your entire professional experience in a manner that individual sections cannot, it can also leave a pleasant impression on the hiring manager."}
{"content": "From my personal experience as a software engineering interviewer, I highly recommend professional summaries, as interviewers generally may not have the time to read into the detail - hence summaries which directly address why a candidate is a good fit for the job greatly improves their chances of capturing attention."}
{"content": "Here are my top tips for writing a great software engineering resume summary."}
{"content": "Before you start: List down your best selling points​"}
{"content": "From your entire professional experience, list down the most important points that fulfill the job descriptions that you are applying for. This can include job experiences or skills."}
{"content": "Summarize the selling points into your resume summary​"}
{"content": "Summarizing the selling points as much as possible, frame them into a short summary of less than 50 words: Ensure you do these:"}
{"content": "✅ Answer why you are a good fit for the job ✅ Use an active voice ✅ Use action words"}
{"content": "✅ Start with the noun describing your job role e.g. \"Software Engineer\", \"Front End Engineer\""}
{"content": "Write a headline for your resume summary​"}
{"content": "Instead of writing \"Professional Summary\" as the title of the section, further concise your experience into a headline with fewer than 10 words. Treat it like a slightly more elaborate version of your LinkedIn profile headline. Some examples:"}
{"content": "Software Engineer (Full Stack)​"}
{"content": "Software Engineer with X years of full stack web development experience specializing in Ruby on Rails and PostgreSQL. Domain expert in e-commerce and payments field as a result of working at multiple e-commerce companies."}
{"content": "Senior Front End Engineer​"}
{"content": "Front End Engineer with X years of experience and strong fundamentals in Front End technologies. Likes building scalable web infrastructure and making websites fast. Passionate about programming languages, compilers, and developer tooling."}
{"content": "Software Engineering Lead​"}
{"content": "Software Engineer with X years of experience in back end, scaling complex distributed systems, and various cloud platforms. Led over 5 engineering teams with an average size of 6 members across two companies and mentored over 20 junior members."}
{"content": "Senior at University X​"}
{"content": "Senior Year student at University X with a focus on Artificial Intelligence and Machine Learning (ML). Interned at X companies and worked on full stack development and ML engineering roles."}
{"content": "info Read more about how to make your Professional Summary stand out on FAANG Tech Leads' Resume Handbook."}
{"content": "How to write contact information for a Software Engineer​ Must-haves​ Name (Should be included at the very top of the resume)"}
{"content": "Personal phone numberNever include your work phone number here"}
{"content": "Location - City, State, ZipJust enough for recruiters to determine if you are a local or international candidate"}
{"content": "Email addressNever include your work email here I recommend Gmail if you are using other email services LinkedIn profile"}
{"content": "Good-to-haves​ GitHub profile URL Personal website URL Stack Overflow profile URL Medium profile URL"}
{"content": "Competitive coding profileCodeChef HackerRank If a divider is required between information, use \"|\" or tabs"}
{"content": "Where relevant, indicate achievements in coding platforms, for example, max ratings, ranking, number of stars, badges. info"}
{"content": "Read more about getting your contact information section right with FAANG Tech Leads' Resume Handbook."}
{"content": "How to write skills for a Software Engineer​ Include programming languages and tech stacks: Structure in the following manner:"}
{"content": "[Skill summary] : [List skills separated by \"|\"]"}
{"content": "Programming languages - If impressive, include your familiarity by the number of lines you have written, for example \"Over 10,000 lines\""}
{"content": "Frameworks Databases info Read more about listing your skills accurately right with FAANG Tech Leads' Resume Handbook."}
{"content": "How to write work experience for a Software Engineer​"}
{"content": "List your work experience in a familiar format and reverse chronological order. Every job listed should have:"}
{"content": "The company, location, title, duration worked following this structure"}
{"content": "[Company or Organization], [Location] | [Job Title] | [Start and end dates formatted as MM/YYYY] Example"}
{"content": "Facebook, Singapore | Front End Engineering Lead | 08/2018 - Present List of top accomplishments, including:"}
{"content": "Scope of job and skills required"}
{"content": "Accomplishments listed following this structure[Accomplishment summary] : [Action] that resulted in [quantifiable outcome] info"}
{"content": "Read more about presenting your conveying job experience well on FAANG Tech Leads' Resume Handbook."}
{"content": "How to write education for a Software Engineer​"}
{"content": "Most software engineering jobs will require at least an undergraduate degree. However, unless you are a recent graduate or do not have much work experience, it should not be prioritized above your work experience."}
{"content": "Use the following format, eliminating information where it is not relevant:"}
{"content": "[Degree Name], [Year of Graduation - write expected graduation date if not graduated] [University Name], [Location]"}
{"content": "GPA: X.XX / 4.0 (List GPA if more than 3.50/4.00, or more than 4.3 under a 5-point system)"}
{"content": "List key achievements, including leadership positions, skills, societies, projects, awards, etc. Example:"}
{"content": "BSc in Computing, Computer Science, Graduation Year 2015 National University of Singapore, Singapore"}
{"content": "GPA: 3.82 / 4.00 (Magna cum laude) Dean's List, Valedictorian President of hacker society info"}
{"content": "Read more about writing your education history on FAANG Tech Leads' Resume Handbook."}
{"content": "How to write projects for a Software Engineer​"}
{"content": "Include at least 2 projects you have contributed to, outlining your key contributions. Always try to link your project name to GitHub or somewhere the hiring manager can view your project."}
{"content": "facebook/docusaurus"}
{"content": "Maintainer and lead engineer for Docusaurus v2, a static site generator which powers the documentation of many of Meta's Open Source Projects - React Native, Jest, Relay, Reason, etc. Used by 7.6k > projects on GitHub."}
{"content": "How to write awards, accolades and certifications for a Software Engineer​"}
{"content": "Only include achievements related to the job application and try to quantify your achievements. A good format to use would be"}
{"content": "[Year][Quantification] [Competition] Example 2016 | Best All-Round Product out of 50 teams | Facebook Hackathon info"}
{"content": "Read more about presenting your projects effectively on FAANG Tech Leads' Resume Handbook. Craft the perfect resume for FAANG"}
{"content": "Save time crafting your resume with FAANG-quality resume templates and examples which have helped many Software Engineers get interviews at top Bay Area companies!"}
{"content": "Optimize your resume with keywords​ must-haves to optimize your content: Less is more​ Do's"}
{"content": "Highlighting a few of your best achievements is better than including many \"average\" achievements in your resume"}
{"content": "Use only 1 page for your resume Don'ts Do not list all your achievements just to showcase a greater quantity without filtering"}
{"content": "Keyword optimization​"}
{"content": "Imagine you are a hiring manager or recruiter screening a resume while juggling many other tasks in your job - you simply won't have much time on each resume! When a hiring manager looks at a resume, they are in fact quickly scanning for keywords of skills or experiences that they value, before paying any additional attention to your resume."}
{"content": "Recruiters and ATS do that as well, but based on the job description that the hiring manager helped to write. That is why optimizing your resume based on job descriptions is very important."}
{"content": "info"}
{"content": "Some ATS will determine the strength of your skills based on the frequency of a keyword in your resume, and others assign an estimated amount of experience for a skill based on its placement in your resume."}
{"content": "For instance, if your previous job experience was 3 years long and you mentioned handling Search engine marketing (SEM), the ATS will assume 5 years of SEM experience."}
{"content": "Include keywords from job descriptions into your resume​"}
{"content": "You should always analyze the job description for must-have and good-to-have skills or experiences and ensure the keywords are added to your resume."}
{"content": "Include them under the \"Skills\" section and pepper the same keywords into the \"Work Experience\" and \"Education\" sections. Be sure to closely imitate the language within the job description."}
{"content": "Remember to include the full version of common abbreviations as well. E.g. Amazon Web Services instead of AWS, Google Cloud Platform instead of GCP."}
{"content": "However, do not do keyword stuffing for the sake of it - always remember that the resume will be read by a recruiter or hiring manager eventually."}
{"content": "Optimize keyword frequency and placement​"}
{"content": "Analyze the job description and determine how important each skill and experience is, then optimize the frequency of the keyword according to its importance."}
{"content": "Expert tip While optimizing for every application is ideal, you can generalize your resume to a type of position."}
{"content": "Collate 3 to 5 job descriptions for that position"}
{"content": "Copy and paste them into a .txt file and upload it into a free \"word and phrase\" frequency tool like Online-Utility.org's Text Analyzer to identify regularly used keywords"}
{"content": "Incorporate skills and experiences that you have into the resume Get your resume reviewed for free"}
{"content": "Try out our free new community-powered resume review portal. Upload a resume, receive helpful comments and feedback from community members."}
{"content": "Free tools to review your resume​ I recommend using these free tools to optimize your resume: 1. Free resume review​"}
{"content": "Tech Interview Handbook has a resume review portal where you can upload your resume and get helpful comments and feedback from other community members and even the authors of Tech Interview Handbook!"}
{"content": "If you are willing to spend some money we recommend FAANG Tech Leads' Resume Review service where your resume will be reviewed by ex-FAANG hiring managers and engineers, not random writers who don't understand technology."}
{"content": "2. Test readability with industry-standard ATS​"}
{"content": "Test the readability and formatting of your resume using industry-standard ATS like Resume Worded or free tools like AI Resume Judge. Most big companies use such resume scanners."}
{"content": "Tailor your resume according to the job requirement. You can use tools like Targeted Resume or Resume Shortlister to check how good your resume is for the job you are applying for. It gives you good improvement tips and a list of keywords that you can add to your resume for better chances in ATS ranking."}
{"content": "3. The plain text file test​ Simply copy the content from your resume and paste it into a plain text document! Make edits if:"}
{"content": "There are points missing from your original resume Characters are displaying incorrectly in plain text Sections are disorganized"}
{"content": "Crafting the perfect cover letter​"}
{"content": "Your cover letter serves as a handshake, an introduction to the professional persona encapsulated in your resume. It's an avenue to express your genuine interest in a position or a particular company, portraying the value you can add to the organization. Unlike the formal tone of a resume, a cover letter allows for a unique, creative expression of your personal brand, ensuring it complements rather than replicates your resume."}
{"content": "Tailoring is key in crafting a compelling cover letter. It is about aligning your skills and aspirations with the role at hand, going beyond mere name switches. Hence, delve into the company's ethos, the industry, and the specific role, letting your cover letter reflect a clear understanding and a deliberate choice. You need to show that you have done your research and you understand the company mission and how you will contribute towards that goal."}
{"content": "Expert tip"}
{"content": "The cover letter should highlight the resume, rather than duplicate the content (which is what is seen too often). In some cases, the cover letter will be the first document, and sometimes, the only document an employer or recruiter sees, and as such, should make a stellar first impression."}
{"content": "Here's a structure to transform your cover letter into a compelling narrative:"}
{"content": "Capture Attention: In your opening paragraph, succinctly present the primary reasons you are an ideal candidate for the job."}
{"content": "Express Your Value: Highlight what you bring to the table, how you can contribute to the company's goals."}
{"content": "Narrate Succinctly: People resonate with stories. Share a brief, relevant narrative that leaves the reader intrigued. Similar to your resume, you should very rarely go beyond the one page limit."}
{"content": "Common pitfalls to avoid on your cover letter​"}
{"content": "The Generic Trap: Tailor your cover letter to the job and company. Avoid a one-size-fits-all approach."}
{"content": "Repetition: Your cover letter should accentuate your resume, not echo it."}
{"content": "Over-verbosity: Keep it crisp, to the point, and under a page."}
{"content": "Sloppiness: Errors in spelling or grammar reflect poorly on your attention to detail. Proofread meticulously. Practical tips​"}
{"content": "Align your qualifications with the employer's needs."}
{"content": "Keep it engaging. Avoid cliches and standard phrases. Your first paragraph should capture the attention of the employer."}
{"content": "Ensure your cover letter is free from errors. Enlist a friend to review it or put it aside and review with fresh eyes later."}
{"content": "Cover letter example and evaluation​ Example of an ML Engineer Cover Letter: Paragraph 1: The Hook and personal touch"}
{"content": "Growing up in Argentina, questions about economics are part of everyday life long before you become an Economics student. While many developing countries suffer the consequences of natural disasters or geopolitical conflicts, most - generations of Argentines have spent their entire lives avoiding the consequences of the crisis caused by macroeconomic imbalances in our country. Possibly due to this history, it is practically impossible to spend a day of your life without listening to a friend or family member make predictions about what the exchange rate between the peso and the dollar should be, or their opinion about what should be done by the Central Bank to lower inflation."}
{"content": "Paragraph 2: Motivation, background and growth story"}
{"content": "Curiosity to find an answer to these daily questions was what motivated me to start my Degree in Economics at the University of Buenos Aires. I did my entire university career while working at the [BANK], experience that was exhausting and challenging in similar proportions. During my eight years working in a financial institution, I have seen first-hand how new technologies and Big Data tools have been transforming the way in which corporate decisions are made. That aroused my curiosity in the different Machine Learning techniques and for that reason I moved to Madrid to perform my Master in Big Data. After that, I was approached by a recruiter that gave me the opportunity to unleash my skills in the gaming industry in London."}
{"content": "Paragraph 3: Showcase achievements, impact and stakeholder management"}
{"content": "[GAMING COMPANY] gave me an incredible opportunity. For the first time in my career, I was able to connect my childhood memories as a gamer with my professional skills. The capable leadership at [GAMING COMPANY] quickly identified my project management and analytical skills and they gave me huge responsibilities. I worked closely with the Chief Strategy Officer and the Head of External Developer Relations to identify potential publishing and M&A opportunities. During my watch we closed two strategic deals that are now contributing with more than 10% of the portfolio revenue. After that incredible experience, I was invited to join a start-smaller SaaS mobile data company called [SAAS COMPANY]. It was a hard decision but the challenge of joining a start-up and helping they grow and expand globally was an opportunity that I could not decline."}
{"content": "Paragraph 4: Motivation to join the company aligned with personal values"}
{"content": "After [SAAS COMPANY] I had the opportunity to apply my skills in the Fintech industry. Coming from Argentina, where the population suffer the consequences of the absence of good credit, I was extremely excited about [BNLP FINTECH]’s mission of democratizing free-credit in the UK and the U.S."}
{"content": "One of the best ways to figure out what to add to your resume is by looking at some resume bullet point examples."}
{"content": "According to recent polls, hiring managers said that less than 9% of the resumes they received were well written."}
{"content": "When you realize that on average each job opening gets 250 applications and only 6 people get an interview, it can make job searching feel very daunting."}
{"content": "But that’s exactly where your resume bullets come into play."}
{"content": "Taking a little time to learn how to write resume bullet points can be the difference between landing interviews vs wasting your time."}
{"content": "That’s why in this post I’ll show you:\nIf you’d like to get even more ideas for your bullet points, you can try one of these free resume builders that I’ve tested and recommend."}
{"content": "Each one of these can generate bullet points for your specific job using AI. These have gotten quite good these days so definitely worth a try."}
{"content": "Alright, now let’s jump in!"}
{"content": "resume bullet point mistakes\n2 Biggest Mistakes 90% of People Make\nWhile it may be exciting to jump straight into writing your resume bullets, there is a very good reason to learn what makes a great bullet point first."}
{"content": "On average, we only have about 10–30 seconds of a recruiter’s attention."}
{"content": "That’s why it’s absolutely crucial to make every bullet point count."}
{"content": "Before we jump into the resume bullet point examples, let me first cover the two big mistakes that you should avoid when writing your resume bullets."}
{"content": "If you avoid these two mistakes, you’ll be ahead of 90% of other job applicants."}
{"content": "Mistake #1: The “and” Test\nThe most common mistake that job seekers make when writing their resume bullets is adding too much information into every bullet."}
{"content": "This is a very easy mistake to make."}
{"content": "After all, when you’re not getting any interviews, the first logical conclusion to make is that you don’t have enough on your resume."}
{"content": "But, working with hundreds of job seekers, I’ve actually seen the opposite to be true."}
{"content": "👉 As we cover in our free resume course, resumes with 350–500 words tend to get the most interviews."}
{"content": "(Have you checked your resume word count? If you haven’t, just go to “Tools” and “Word Count” in Google Docs or Word to find out)"}
{"content": "The easiest way to shorten your resume is by following these 5 simple steps:"}
{"content": "Press Ctrl + F (command + F on a Mac)\nType in the word “and”\nThis will highlight all the ands in your resume\nLook for any sentence or bullet point that has more than one “and” in it\nReword your bullet points so that they only have one “and”\nbullet point examples for resume\nUse ctrl + F (command + F on a Mac) to find all your \"ands\""}
{"content": "Mistake #2: Responsibilities vs Actions\nThe second most common mistake is when job seekers write out their responsibilities instead of their actions."}
{"content": "Here are some examples of poorly written resume bullets:"}
{"content": "Excellent communication and presentation skills, able to articulate product vision and strategy to stakeholders\nProven ability to lead cross-functional teams and drive collaboration\nExperienced in user research, testing, and design thinking\nThese types of bullet points are passive and merely explain what skills you have."}
{"content": "Now, you might be thinking, “isn’t that the point of a resume?”"}
{"content": "Well yes, your resume should show your skills, but it should do so through your actions."}
{"content": "👉 Here are those exact same 3 bullet point examples, but written in active voice using power verbs:"}
{"content": "Developed clear product vision and strategy for stakeholders\nImproved collaboration for cross-functional teams\nRan user research and testing using design thinking principles\nCompare the two examples and you can see how much clearer and more concise the active versions are."}
{"content": "how to write a good resume bullet point\n3 Parts to Every Great Resume Bullet Point\nNow that we’ve seen the two most common mistakes, let me explain what makes a great resume bullet point in the first place."}
{"content": "In short, every great resume bullet point has 3 elements:"}
{"content": "A power verb\nA method/skill\nA result\nresume bullet point example and structure\nDiego Granados, a Senior Product Manager who has landed jobs at Cisco, Microsoft, and LinkedIn, explained this best when he said:"}
{"content": "“It’s best to write your accomplishments with the X-Y-Z framework. In my resume I write my accomplishments using the X-Y-Z formula (shared by Google recruiters).\n👉 “Accomplished [X], as measured by [Y], by doing [Z]”\nFollow this resume bullet point formula as close as possible, but don’t be afraid to put your own style into it (as long as you share your X,Y & Z).”"}
{"content": "I’ve read hundreds of resumes over the years and I’ve noticed that most job seekers tend to get 2 out of the 3 elements in there, but rarely have all 3."}
{"content": "As you look through the resume bullet point examples below, notice that the strongest ones tend to have X, Y, & Z elements in them."}
{"content": "In simple terms you want to fill in the blanks for the following sentence:"}
{"content": "I [Power verb] by doing [Skill/Method] to accomplish [result]."}
{"content": "If you’re in a role where it might be tricky to figure out these pieces, here’s a great video from award-winning career coach, Gillian Kelly, that can help:"}
{"content": "Alright, now that we know what to look for in a bullet point, let’s look at some resume bullet point examples."}
{"content": "Sales Resume Bullet Point Examples\nIf you’re writing a sales resume, you’ll want to focus a lot of your resume on the metrics that drive the business forward. Luckily, most sales roles have a lot great metrics you can use."}
{"content": "Here are a few bullet point examples for sales roles:"}
{"content": "Resume bullet point examples for personal accomplishments:\nExceeded annual sales quota by 20%\nBuilt a sales pipeline of 100 new clients\nDeveloped a new sales strategy resulting in a 25% increase in revenue\nSecured $1M in new business contracts\nNegotiated and closed complex deals with key stakeholders\nImproved sales processes to increase efficiency and productivity\nBullet point examples for sales management:\nDirected a team of 5 sales representatives resulting in a 40% increase in team performance\nCoordinated with cross-functional teams to ensure timely delivery of products and services\nMonitored sales metrics and provided regular performance feedback to leadership\nDeveloped relationships with key customers and partners\nBullet point examples for sales featuring hard metrics:\nBoosted sales revenue by 30% through effective sales techniques\nExpanded customer base by 50% through strategic account management\nImproved customer retention by 20% through high-touch sales techniques\nGrew market share by 25% through successful product launches and marketing initiatives."}
{"content": "Product Manager Resume Bullet Point Examples\nProduct Manager resumes tend to focus a lot on cross-functional collaboration. That being said, you’ll still want to incorporate metrics into your resume if you want it to be as strong as possible."}
{"content": "Note: These resume bullet point examples tend to also work very well for other cross-functional roles such as Project Manager resumes and Product Marketing resumes."}
{"content": "Resume bullet point examples for Product Managers & Project Managers:\nLed cross-functional teams to develop and launch multiple new products\nImplemented agile methodologies to improve product development processes\nConducted market research and analysis to inform product strategy\nConducted user research and testing to inform product design\nManaged multiple product roadmaps, budgets, and timelines\nNegotiated partnerships and contracts with key suppliers and vendors\nBullet point examples for Product Managers focused on results:\nAchieved 20% YoY growth in revenue for key product line\nIncreased user engagement by 40% through data-driven product improvements\nReduced product development time by 50% through process optimizations\nImproved product quality and customer satisfaction ratings by 25%\nIncreased product adoption by 20% by working with GTM teams\nBullet point examples for Product Managers focused on skills:\nImplemented Agile and Scrum techniques to increase productivity\nIdentified key trends and insights from user data\nPresented product vision and strategy to leadership\nLed cross-functional teams to increase collaboration\nLed user research, testing, and product design\nImplemented JIRA and Asana to streamline product development"}
{"content": "Customer service resume examples\nCustomer Service Resume Bullet Point Examples\nOne of the main struggles when writing resume bullet points for a customer service role is a lack of clear metrics. Many customer service professionals find it hard to put metrics behind what is a very “people” focused role."}
{"content": "If you’d like to learn how to write better bullet points, I recommend reading our full resume bullet point guide here. In the guide, I break down exactly how to find your metrics for these types of roles."}
{"content": "Let’s take a look at some resume bullet point examples for more people-focused roles:"}
{"content": "Resume bullet point examples for customer service roles:\nResponded to customer inquiries through phone, email, and chat\nTrained new hires on customer service processes and policies\nCollaborated with cross-functional teams to resolve complex customer issues\nManaged and prioritized customer service queues to meet response time goals\nConducted customer satisfaction surveys to gather feedback and improve service quality\nImplemented process improvements to increase efficiency and customer satisfaction\nBullet point examples for customer service roles focused on results:\nImproved customer satisfaction scores by 20% through regular engagement and feedback processes\nReduced customer churn by 10% through proactive outreach and issue resolution\nIncreased response efficiency by 30% by streamlining processes\nAchieved 100% compliance with customer service policies and procedures\nResolved over 95% of customer issues within 24 hours\nImproved call handling time by 25% through enhanced training\nBullet point examples for customer service roles focused on skills:\nEstablished strong customer relationships to reduce churn\nResolved conflicts and improved customer relationships\nImplemented Zendesk and Salesforce to streamline operations\nIdentified trends and insights using company data\nTrained team members to improve performance\nMaintained accurate and complete customer records\nMarketing resume examples\nMarketing Resume Bullet Point Examples\nThe best marketing resumes have a mixture of both hard and soft skills. The most common mistake that job seekers make when writing a marketing resume is not including enough metrics."}
{"content": "While it can be hard to find exact metrics for your marketing job, there are definitely ways to estimate your impact. You can see how in the resume bullet point guide I put together here."}
{"content": "Let’s take a look at some solid marketing bullet point examples you can use for your marketing resume:"}
{"content": "Resume bullet point examples for marketing roles:\nCreated a comprehensive market research plan to identify new business opportunities\nImplemented customer segmentation strategy\nFormed key partnerships with industry leaders, driving sales and brand awareness\nImplemented data-driven approach resulting in more efficient budget allocation\nStreamlined marketing processes to reduce costs on social channels\nLed company-wide brand re-positioning campaign\nIntroduced new CRM system that improved customer data tracking and analysis\nBullet point examples for marketing roles focused on results:\nRevamped email marketing campaign that increased open rates by 30%.\nDeveloped lead generation program resulting in a 40% increase in qualified leads\nCreated SEO strategy that increased organic traffic by 50%\nProduced 40 product videos that drove 1M impressions\nIncreased website traffic by 65% through SEO optimization\nCreated direct mail campaign that increased lead conversion by 25%\nBullet point examples for marketing roles focused on management:\nHired and managed a team of 8 marketers\nLed execution of multi-channel marketing strategies\nManaged production team to create award-winning content\nDeveloped successful influencer marketing program featuring 23 industry influencers\nLed redesign of the company’s website resulting in a 20% increase in traffic\nRan a series of webinars to convert potential customers\nBuilt content marketing plan to reach target audiences\nImplemented creative brief template to streamline the development of content\nDeveloped trade show program including 9 trade shows per year\nBuilt referral program from the ground up to increase lead generation\nFinance resume examples\nFinance & Operations Resume Bullet Point Examples\nFinance resumes and Operations resumes have a lot in common since they are both very numbers driven. This makes writing resume bullet points a bit easier, but having a good diversity of skills shown is still very important."}
{"content": "In our resume bullet point guide I explain how to balance your bullet points across your various skills. Let’s take a look at some finance bullet point examples (which can also be adapted for operations roles):"}
{"content": "Resume bullet point examples for finance roles:\nReduced costs by $500,000 through streamlining procurement processes\nAchieved a 15% increase in investment portfolio performance through strategic asset allocation\nIncreased revenue by 20% through market analysis\nStreamlined procedures to achieve 95% compliance rate for financial reporting\nBullet point examples for finance roles focused on management:\nManaged and coached a team of 3 finance analysts\nManaged a budget of $10 million across 3 industries\nCreated monthly, quarterly, and annual financial statements\nReduced financial risk for the company by implementing internal controls and monitoring systems\nLed the creation of financial reports for the leadership team\nDeveloped new system for tracking and reporting sales commissions\nBullet point examples for finance roles focused on improvement:\nImproved cash flow by 25% through negotiating better payment terms with suppliers\nImproved accuracy of financial reporting by implementing X software\nImproved credit rating by addressing debt covenants and improving liquidity\nIncreased accounting efficiency by 25% through automation and process improvement initiatives\nAre there periods after bullet points in a resume ?\nOne question I frequently get asked is, “should I include periods after bullet points on my resume?” In most cases, you do not need to include periods after your bullet points."}
{"content": "The only time you would need to include periods after your bullet points is if you’re writing in full sentences. As we’ve covered before, it’s much better to use bullet points instead of sentences or paragraphs on your resume."}
{"content": "Is it worth using a resume bullet point generator?\nYou may have heard that some people these days are using resume bullet point generators to create their resumes."}
{"content": "While resume bullet point generators can be hit or miss, they can be useful. I personally like to use these generators to get ideas for my resume bullet points (which I then customize to my exact needs)."}
{"content": "If you’d like to get even more ideas for your bullet points, you can try one of these free resume builders that I’ve tested and recommend. Each one has a resume bullet point generator that’s actually very useful for getting ideas."}
{"content": "Takeaways and Next Steps\nFeel free to use any of the bullet point examples above on your resume. And, to learn more about the other elements you should include on your resume, such as how to write your resume summary or how to choose your resume color, I recommend going through our free resume course."}
{"content": ""}
{"content": "How to Create Strong Resume Bullet Points\nFrom the Office of Career Services, here is how to create a strong resume with specific bullet points"}
{"content": "Use bullet points with descriptive statements displaying skills, abilities, and professional accomplishments (begin with a power verb).\nConsider the job you are applying for - what are the qualifications and skills they are seeking?\nTry to include quantifiable results (number of people on a team, cost reductions, etc.)"}
{"content": "STAR Method\nConsider the STAR method when reading a job description and brainstorming significant accomplishments you would like to highlight on your resume (this method is often utilized for interviewing too!):"}
{"content": "Situation: What was the situation, problem, or conflict you were facing?"}
{"content": "Task: What were you tasked with? What were your responsibilities or goals?"}
{"content": "Action: What action did you take? What did you do to solve this problem? (start with action verbs)"}
{"content": "Result: What was the result or outcome of your action? How did it benefit the organization?Can this result be quantified?"}
{"content": "Outlining the Impact\nConsider the following when forming a bullet point:"}
{"content": "WHAT skill am I trying to convey?\nHOW did I contribute or help accomplish the task/duties?\nWHY did I complete, influence, improve the situation/task?\nWhat was/is the IMPACT of my actions/accomplishments? (quantify accurately when possible)\nSimple formula: Power Verb + What you did + Results/Purpose"}
{"content": "Bullet Point Example #1\nBEFORE:"}
{"content": "Events Coordinator                                                                                     January 2023 - Present"}
{"content": "Public Health Society                                                                                                   Dearborn, MI"}
{"content": "Responsible for organizing events and panels\nUse social media to market materials and events AFTER:"}
{"content": "Events Coordinator                                                                                    January 2023 - Present"}
{"content": "Public Health Society                                                                                                   Dearborn, MI"}
{"content": "Plan and coordinate panels on public health for audiences of 25–50 undergraduates on a bi-monthly basis. \nIdentify and contact health professionals in the community to participate in panels\nCreate marketing materials and publicize events through social media\nEXAMPLE 1 Explained:"}
{"content": "First bullet point: highlights organizational skills and lets the employer know the scope, target audience, and frequency of the events.\n \nSecond bullet point: indicates research and interpersonal skills used to secure panelists and demonstrates the ability to communicate with professionals outside of the university.\n \nThird bullet highlights a specific business skill and/or the ability to be strategic in \nmarketing, as well as familiarity with using social media for marketing purposes.\nCould add in more action/result with the following:\nCreate marketing materials and publicize events through social media. Increased attendance at several club programs by 75% (if you have an accurate figure)"}
{"content": "Bullet Point Example #2\nBEFORE:"}
{"content": "Research Assistant                                                                                         June 2022 - May 2023"}
{"content": "University of Michigan-Dearborn                                                                                   Dearborn, MI"}
{"content": "Collected and analyzed data using statistical tools\nComposed an abstract and poster presentation\nAFTER:"}
{"content": "Research Assistant                                                                                         June 2022 - May 2023"}
{"content": "University of Michigan-Dearborn                                                                                   Dearborn, MI"}
{"content": "Examined the effects of particle wear on the bony fixation of a simulated hip implant in vivo using micro computed tomography\nConducted various biomechanical studies using an Instron machine and strain gauges on cadaveric specimens and anatomical surrogates\nDeveloped procedures for data management and analytics from simple descriptive statistics to multivariate techniques such as cluster analysis, factor analysis, multiple regression, and propensity score matching to text analysis.\nComposed an abstract and poster presentation to disseminate findings to the scientific community\nEXAMPLE 2 Explained:"}
{"content": "The ‘after’ bullet points are much more specific. They describe the actual tools and technologies that the research assistant used."}
{"content": "The first bullet point shows that the student has experience working with animal models and a micro-CT.\nThe second bullet lists an Instron machine which is used in biomechanics research and also materials testing and strain gauges which measure the change in length of a material and have many applications as well.\nThe third bullet lists specific statistical tools that the student used and demonstrates some knowledge and expertise in that area.\nThe final bullet shows that you know how to effectively communicate your findings. If you didn’t author an abstract, you might want to discuss a presentation you made to your research group or you can include the poster presentation that you will do at the end of the summer."}
{"content": "An Ex-Meta Recruiter's Inside Guide to Creating a Stand Out SWE Resume selena ma Feb 25, 2022 9 min"}
{"content": "After 10+ years in tech recruiting, these are the things I wish every software engineer resume would include (and exclude)."}
{"content": "Selena has more than 10 years of experience in recruiting. She's the Head of Fellowship Recruitment at Formation, a virtual fellowship for software engineers looking to take the next step in their career."}
{"content": "I’ve lost track of how many software engineer resumes I’ve sifted through, but it’s probably somewhere in the tens of thousands range. During my 10 years as an engineering recruiter at both Meta (Facebook then) and Google, I hired recent graduates, experienced software engineers, and everyone in between. I know exactly what a recruiter is looking for when they skim your resume."}
{"content": "While the current state of the job market is not as bad as the headlines suggest, submitting a polished resume is still incredibly important. And with the number of software engineers looking for roles, you'll want your resume to stand out. If you're thinking about your next role or are in the process of doing so, now is the time to make your software engineering resume stand out. Along with some examples of what a good resume looks like, here are some guidelines and tips to help you create a software engineer resume that’ll catch any recruiter’s eye."}
{"content": "What should be included in a software engineer resume?"}
{"content": "Recruiters have seen it all, which means they can sniff out a bad resume in just a few seconds. Broken down by category, here is what should be included in any software engineer resume:"}
{"content": "Basic info Education Experience Skills Affiliations/Organizations 1. Basic info"}
{"content": "In general, your basic info should be somewhere at the top of the page, either right at the top or at the top of the sidebar. Here's an example:"}
{"content": "Your name should be the largest text on your resume and positioned in a prominent way (e.g., top, centered)"}
{"content": "Desired position (e.g., “software engineer\") is clearly stated in the header unless you have 2+ years of experience"}
{"content": "Your physical address is optional, but it’s a good idea to have some identifier that you’re in the US and have visa status. You can use your region (e.g., “Bay Area”) or city and state."}
{"content": "Email address is professional"}
{"content": "LinkedIn and Github are optional, but if you include them, ensure each URL is hyperlinked and do not have the “https://” prepended"}
{"content": "If including a summary, all parts are factual, relevant, specific and it is a maximum of 1-2 sentences long, geared toward type of desired role if necessary"}
{"content": "2. Education"}
{"content": "Each educational institution you've attended should be listed with its name, campus location, year of degree completion, and degree completed (with minor, if applicable)."}
{"content": "If you’re a recent grad, list upper-level coursework ie.: operating systems, machine learning, etc."}
{"content": "If you’re a recent grad, include your GPA if it’s 3.5+. If it’s lower than 3.5, do not include it."}
{"content": "If you attended a bootcamp, list it in this section, with your most recent one at the top."}
{"content": "If you took individual courses (e.g. Udemy, Coursera) or certifications, do not list them 3. Experience"}
{"content": "A recruiter wants to see the larger scopes of what you did, not just that you did X project. When you’re writing about your experience, talk about it at a higher level and pull out the impact of your work. Each bullet point should address a different impact you had on the company, eg. if you led a team, managed a project, or designed something. Here are some tips to remember when creating the experience section of your software engineer resume:"}
{"content": "Order bullets either from most impactful to least, or in reverse-chronological (most recent first)"}
{"content": "List your experience section as the first section unless you’re a recent grad or still in college (in this case, your education section should come first)"}
{"content": "Include company name, title, dates employed, and location if applicable Limit each experience block to 2-3 bullet points"}
{"content": "Your most recent experience should be the most thorough; older experience can be a bit vaguer"}
{"content": "If you have access to any impressive metrics from projects you did, list them (”leading to...”, “resulting in...”)"}
{"content": "Vary your power verb sentence starters"}
{"content": "Only list experience that is relevant; if it’s not SWE-adjacent, leave it out (eg. server, lifeguard, etc.) 4. Skills"}
{"content": "Your skills section is one of the most important sections you'll include. It will tell the recruiter and, eventually, the hiring manager if you have the skills required for the position you're applying for. Use these pointers to list your skills correctly:"}
{"content": "Your skill section should be listed at the bottom of the resume or in the sidebar. You can also list them next to your relevant coursework if you’re a recent grad."}
{"content": "List skills in order of fluency. The first skill listed should be what you’re interviewing in."}
{"content": "Don’t include languages you don’t know. Skills should all be capitalized correctly."}
{"content": "Each skill listed is relevant to the role you’re seeking."}
{"content": "Skills are correctly categorized (e.g. React is not listed as a language)."}
{"content": "In the two examples below, notice how skills are listed in different areas based on the experience level of each candidate. For the recent grad resume, skills are at the top and combined with relevant coursework; for the senior engineer resume, the skills are listed in the left sidebar."}
{"content": "Senior Software Engineer Resume (Left), Recent Graduate Resume (Right) 5. Affiliations and Organizations"}
{"content": "This section is optional, but if you have organization affiliations, leadership positions, or interesting extracurriculars, this is the place to include them."}
{"content": "If you come from a diverse background, you may indicate it by listing any affiliations, like NSBE, SHPE, WICS, Grace Hopper, Anita Borg, Vets Who Code, etc."}
{"content": "Interests are not necessary, but you may include them if they’re unique or interesting. For example, if you were an Olympic ping pong player or competed on Chopped, that’s something interesting that would pique a recruiter's interest. If you’re including interests, choose no more than 3."}
{"content": "A quick word about formatting"}
{"content": "Recruiters have seen it all, which means they can sniff out a bad resume in just a few seconds. Before we dive into the specifics of a well-done software engineer resume, let’s talk about formatting. Poor formatting is a red flag for a recruiter who is likely going through hundreds of qualified engineers’ resumes. To avoid getting your resume tossed out, follow these tips:"}
{"content": "Length: Keep it to 1 page. There is no reason it should be longer unless you have 10+ years of experience."}
{"content": "Spacing: Even if you have a lot of experience to list, try not to squeeze too many words into one page. Remember, a human is reading your resume, so appropriate spacing is appreciated."}
{"content": "Format: Choose a commonly-used program like PDF or Word. Whatever you use, just make sure your resume is readable and can be downloaded or opened on a variety of devices."}
{"content": "Naming: Use the pattern “[First Name] [Last Name] - [title] [year] resume.pdf”, e.g. “Jackson Smith – Fullstack software engineer 2021 resume.pdf”"}
{"content": "Font size: No smaller than 8, no larger than 24."}
{"content": "Design: Looks modern and is easy to read at first glance. Your resume is the first impression you'll make on a recruiter. They can tell a lot about you based on how modern your resume looks and reads."}
{"content": "Page setup: Your resume should fit on a single 8.5” x 11” page with minimum .5” margins all around"}
{"content": "Bullet points: They don’t need to be full sentences, but they do need to be compete thoughts. Keep it to 3 bullet points or fewer per section."}
{"content": "Past-tense power verb bullet points: This is the standard for all resume language, not just software engineer resumes. Diversify your verbs and make sure they are past-tense if you’re no longer at that company. Only use the present tense if you’re currently working at that company and in that role."}
{"content": "Grammar and spelling errors: Triple-check that you don’t have any."}
{"content": "Below is a sample resume for an experienced software engineer. Notice how the margins are big enough and the spacing feels appropriate which gives it a clean, polished look."}
{"content": "5 Things to Include (and Exclude) in Your Software Engineer Resume"}
{"content": "There are a number of things you should and should not include in your resume. In my experience, these are the top 5 things that candidates get hung up on the most:"}
{"content": "Summary: A summary is not required, but you can include a sentence about who you are and what you’re looking for next. Just keep it short."}
{"content": "Skills: Include your skills in order of fluency, but don’t include languages that you don’t know. The first skill listed should be what you’re interviewing in. More on the specifics of skills later."}
{"content": "Contact info: Include your phone and email. If your email account is on an outdated provider (Hotmail, AOL, etc.), it’s a red flag to recruiters that you’re not up to date with the latest technology and trends. You don’t need to include your physical address, but if you’d like to list your city/state/region for work authorization purposes, that is completely fine."}
{"content": "Links: A clickable link to your LinkedIn/Github account is acceptable, but not necessary. For what it’s worth, a recruiter is not going to look at your Github, but they will definitely find you on LinkedIn."}
{"content": "Projects: If you have 2+ years of experience, projects are optional. That being said, if you don’t have a lot of real tech experience, then you should include any projects. It shows that you’re actively coding every day (or at least often), and that’s important if you’re transitioning into SWE from another career."}
{"content": "Project Guidelines (Expand) Things to Avoid To keep your resume at the top of the pile, avoid:"}
{"content": "Submitting a resume longer than 1 page (without 10+ years of relevant experience or significant publications/awards) Typos!"}
{"content": "Bullet points beginning with non-past-tense power verbs (excluding those in experience blocks that run to present)"}
{"content": "Use of pronouns (“You”, “I”, “Me”, “We”, “Our”, “Us”, “Their”, They”). The summary is the only area where a pronoun is acceptable."}
{"content": "Uneven or misaligned margins or aligns References stated or offered (wait until they ask for them!) Missing contact information"}
{"content": "Submitting a resume that's not in a Word doc or PDF format, or is named improperly (see Formatting) Including photos"}
{"content": "3 Quick Tips for Making Your Software Engineer Resume Stand Out"}
{"content": "The most common mistake engineers (really, all job seekers) make on their resumes is being unable to talk about what they did. Use these final quick tips when writing your resume:"}
{"content": "Focus on impact: This is a subtle yet dramatic shift in the way you should think about writing about your work. It should be less about what you did and more about what your work resulted in."}
{"content": "Get into your readers’ mindset: Recruiters and hiring managers typically care about different things, so it’s important that your resume hits on multiple angles. Recruiters will care more about your business impact and will get lost in the technical details. Hiring managers, on the other hand, care about business impact, but they also like to see technical challenges in your resume."}
{"content": "Explain in exhaustive detail, but NOT in your resume: Be prepared to talk about your projects, both in terms of business impact as well as technical challenges, to recruiters and/or engineers in phone screenings. Anything you can’t talk about for a few minutes should not be included in your resume."}
{"content": "Your resume is your first impression on a recruiter. One look at a resume and I am either fast-tracking you through to an interview loop or tossing out your application. Take the time to really craft your narrative through your software engineer resume and remember to put thought into it—it could land you your next role!"}
{"content": "Comprehensive Guide to Machine Learning Resume Best Practices for Big Tech and Startups"}
{"content": "The machine learning field has become increasingly competitive, with acceptance rates at major technology companies like Google, Amazon, and Apple falling below 1%5. This comprehensive analysis reveals fundamental differences in resume expectations between big tech companies and startups, while identifying universal best practices that can help candidates navigate both environments successfully. The research demonstrates that while technical expertise remains paramount across all contexts, the presentation and emphasis of skills must be strategically tailored to match the distinct cultural and operational needs of different organizational types."}
{"content": "Understanding Different Organizational Expectations Big Tech Company Requirements"}
{"content": "Major technology companies maintain rigorous screening processes that prioritize specific technical competencies and structured presentation. According to insights from FAANG recruiters and coaches, these organizations seek candidates who can immediately answer key questions about their experience5. The primary concern for recruiters is identifying \"years of role-relevant experience\" within the first ten seconds of reviewing a resume5."}
{"content": "Big tech companies particularly value end-to-end machine learning experience, which encompasses \"the entire ML lifecycle, from business understanding to data collection, processing, feature engineering, model training, validation, deployment, and monitoring\"5. This holistic approach demonstrates that candidates understand machine learning not just as isolated technical skills, but as integrated business solutions. Additionally, system design capabilities are crucial for ML engineering roles at these companies, requiring candidates to discuss \"engineering architecture and make decisions from a machine learning design perspective\"5."}
{"content": "The emphasis on quantifiable achievements is paramount in big tech environments. Successful resumes demonstrate impact through specific metrics, such as \"decreased server response time by 30% by implementing machine learning implementation\"5. These organizations also place significant weight on prestigious educational backgrounds and previous experience at well-known technology companies, creating a preference for candidates with recognizable institutional affiliations."}
{"content": "Startup Environment Expectations"}
{"content": "Startup environments prioritize versatility and adaptability over specialized depth. These organizations \"often operate with lean teams, requiring employees to wear multiple hats\"12. Consequently, startup resumes should emphasize the ability to \"handle diverse roles and responsibilities\"12. The ideal startup candidate demonstrates an entrepreneurial mindset, showing \"proactive and ownership-oriented approach\" even without founding experience12."}
{"content": "Startups value problem-solving abilities above formal credentials, seeking candidates who can \"identify challenges and deliver solutions\"12. The focus shifts from following established processes to innovating and creating new approaches. Unlike big tech companies that may have dedicated teams for specific functions, startup employees must be comfortable with ambiguity and rapid change."}
{"content": "The cultural fit becomes equally important as technical skills in startup environments. These organizations look for candidates who demonstrate \"passion for startups\" and alignment with their mission12. Side projects and freelance work carry particular weight, as they showcase \"ability to work independently and develop diverse skills\"12."}
{"content": "Essential Resume Structure and Components Optimal Section Organization"}
{"content": "The strategic organization of resume sections varies significantly based on the candidate's experience level and target environment. For experienced professionals, the recommended order prioritizes work experience, followed by projects, skills, and education2. However, career changers and fresh graduates should adapt this structure to highlight their strongest qualifications first."}
{"content": "Recent graduates should \"put the education section first, add information about final grades (only if favorably high), and describe coursework or dissertation in more detail\"2. Career changers entering machine learning from other fields should \"focus on Projects and Skills and write less on work experience and education\"2. This flexibility ensures that the most relevant information appears prominently, regardless of traditional career progression."}
{"content": "The contact information section, while seemingly straightforward, requires careful attention to professionalism and digital presence. Modern resumes must include \"links to online profiles\" such as LinkedIn, GitHub, and personal portfolios12. This digital footprint has become essential for demonstrating ongoing engagement with the technical community and showcasing practical work."}
{"content": "Technical Skills Presentation"}
{"content": "Machine learning resumes require dedicated sections for technical competencies, with careful attention to both breadth and depth of expertise. The skills section should comprehensively list \"programming languages, frameworks, and tools\" with specific emphasis on Python, R, TensorFlow, Keras, and Apache Spark13. However, the presentation must go beyond mere enumeration to include \"real-world applications of these tools\"13."}
{"content": "The technical skills presentation should be strategically aligned with job requirements. For machine learning roles, essential keywords include \"machine learning, data visualization, Python, statistical modeling, deep learning, neural networks, algorithm development, and model deployment\"10. The inclusion of these terms serves dual purposes: demonstrating genuine expertise and ensuring compatibility with Applicant Tracking Systems."}
{"content": "Advanced practitioners should emphasize specialized competencies such as \"linear algebra, calculus, probability, and statistics\"15. Mathematical proficiency underlies all machine learning applications, and explicit mention of these foundations signals serious academic preparation. Additionally, cloud platform experience with \"Google Cloud AI and AWS AI Services\" has become increasingly valuable as organizations migrate to distributed computing environments15."}
{"content": "Project Showcasing and Experience Documentation Effective Project Description Methodology"}
{"content": "Project documentation represents the most critical component of machine learning resumes, serving as concrete evidence of practical capabilities. Successful project descriptions follow a structured approach that emphasizes problem definition, methodology, and quantifiable outcomes. The recommended format includes specific challenges addressed, technical approaches employed, and measurable results achieved13."}
{"content": "Each project description should specify the \"technologies used and outcomes achieved\"15. For example, rather than simply stating involvement in recommendation systems, candidates should detail: \"Designed and implemented a recommendation system for a healthcare application, increasing engagement by 26%\"13. This approach demonstrates both technical competency and business impact awareness."}
{"content": "The selection of projects for inclusion should prioritize relevance and diversity of techniques. Candidates should showcase experience across different machine learning domains, including \"classification, regression, clustering, and recommendation systems\"7. This breadth demonstrates adaptability and comprehensive understanding of the field's applications."}
{"content": "Experience Section Optimization"}
{"content": "The work experience section requires careful balance between technical details and business impact. Following the \"X, Y, Z\" formula recommended by former Google SVP Lazlo Bock, each bullet point should specify \"Accomplished [X] as measured by [Y] by doing [Z]\"5. This structure ensures that technical activities are clearly connected to measurable business outcomes."}
{"content": "Action verbs play a crucial role in conveying impact and leadership. Effective machine learning resumes incorporate verbs such as \"executed,\" \"unblocked,\" \"led,\" and \"delivered\"5. These terms reflect the key skills that companies seek: leadership, communication, facilitation, and data analysis capabilities. The choice of action verbs should align with the specific requirements of target roles."}
{"content": "Quantification remains paramount throughout the experience section. Rather than listing responsibilities, successful resumes focus on achievements with specific metrics. Examples include \"improved data mining and automation by 45% using a scalable classifier\"1 and \"reduced daily data processing time by 77% by implementing stored procedures\"6. These concrete numbers provide tangible evidence of contribution and impact."}
{"content": "ATS Optimization and Keyword Strategy Understanding Applicant Tracking Systems"}
{"content": "Modern recruitment processes rely heavily on Applicant Tracking Systems that filter candidates based on keyword matching. These systems \"screen resumes for specific keywords relevant to data science roles\"10, making strategic keyword inclusion essential for initial screening success. The challenge lies in incorporating relevant terms naturally while maintaining readability and authenticity."}
{"content": "Effective ATS optimization requires careful analysis of job descriptions to identify critical terms. Candidates should \"study the language of the job description and where appropriate, match specific verbs and phrases\"5. However, this matching must avoid \"keyword stuffing\" that compromises resume quality. The goal is natural integration that demonstrates genuine expertise rather than superficial optimization."}
{"content": "The most effective approach involves understanding that \"ATS doesn't always recognize synonyms\"11, requiring exact phrase matching from job postings. This precision necessitates customized versions for different applications, as \"tailoring your resume for each job\" significantly improves success rates11."}
{"content": "Strategic Keyword Integration"}
{"content": "For machine learning roles, essential keywords span multiple categories including programming languages, frameworks, methodologies, and business applications. Core technical terms include \"Python, TensorFlow, PyTorch, Scikit-Learn, deep learning, neural networks, computer vision, natural language processing\"10. These foundational terms should appear naturally throughout skills sections and project descriptions."}
{"content": "Advanced roles require specialized terminology such as \"reinforcement learning, generative adversarial networks, transformer models, MLOps, model deployment, and data pipelines\"10. The inclusion of these terms signals expertise in cutting-edge techniques and operational considerations that distinguish senior practitioners from entry-level candidates."}
{"content": "Business-oriented keywords bridge technical capabilities with organizational needs. Terms such as \"predictive modeling, business intelligence, data-driven decision making, customer insights, and performance optimization\"10 demonstrate understanding of machine learning's commercial applications. This business awareness has become increasingly important as organizations seek candidates who can translate technical capabilities into strategic value."}
{"content": "Formatting and Design Excellence Professional Presentation Standards"}
{"content": "Visual presentation significantly impacts resume effectiveness, with recruiters spending \"less than a minute scanning each resume\"13. Consequently, formatting must prioritize clarity and professional appearance through consistent typography, spacing, and organization. The recommended approach emphasizes \"clean, well-organized format\" that ensures \"skills and achievements stand out\"13."}
{"content": "Font selection should prioritize readability over creativity, with \"professional and easy-to-read fonts like Arial, Times New Roman, or Calibri\"4. Consistency across font sizes, line spacing, and margins maintains visual cohesion throughout the document4. Strategic use of formatting elements such as \"bold, italics, or bullet points\" can emphasize \"key skills, achievements, and project details\"4 without overwhelming the reader."}
{"content": "Length considerations vary by experience level and target audience. While \"one page (if possible)\" remains ideal for most positions12, senior roles may warrant additional space for comprehensive experience documentation. The key principle involves maximizing information density while maintaining readability and professional appearance."}
{"content": "Modern Design Considerations"}
{"content": "Contemporary resume design must balance creativity with compatibility across different viewing platforms. While \"modern, clean layouts with easy-to-read fonts\" appeal to human reviewers12, ATS compatibility requires avoiding \"overloading with graphics\"12 that may cause parsing errors."}
{"content": "The integration of digital elements has become standard practice, with successful resumes including \"links to LinkedIn, GitHub, and personal portfolios\"12. These connections extend the resume beyond static documents to dynamic demonstrations of ongoing professional engagement and technical contributions."}
{"content": "Color usage should remain conservative to ensure professional appearance across different printing and viewing contexts. Strategic application of color for section headers or accent elements can enhance visual appeal without compromising readability or professional standards."}
{"content": "Advanced Strategies for Competitive Differentiation Certification and Continuous Learning"}
{"content": "Professional development demonstration has become crucial for standing out in competitive machine learning markets. Successful candidates highlight \"relevant certifications such as Google's Professional Certificate in Machine Learning\"19 and specialized programs like \"MIT's AI and ML leadership programs\"13. These credentials signal commitment to continuous learning in a rapidly evolving field."}
{"content": "The presentation of ongoing education should emphasize current engagement rather than historical completion. Mentioning \"current courses in data science\"20 demonstrates active skill development and awareness of emerging technologies. This ongoing learning orientation aligns with the field's rapid evolution and employer expectations for adaptable professionals."}
{"content": "Academic achievements retain particular importance for research-oriented positions and roles at institutions with strong academic cultures. Advanced degrees, publications, and conference presentations provide credibility for positions requiring theoretical depth and research capabilities."}
{"content": "Portfolio Integration and Digital Presence"}
{"content": "Modern machine learning professionals must maintain comprehensive digital portfolios that extend beyond traditional resume constraints. GitHub repositories serve as practical demonstrations of coding abilities and project implementations, providing \"examples of how you operated within platforms to streamline workflows and achieve results\"15."}
{"content": "Portfolio projects should demonstrate end-to-end capabilities rather than isolated technical exercises. Successful examples show \"how you used machine learning to solve problems or create value\"20 with clear documentation of methodologies, challenges, and outcomes. This comprehensive presentation allows potential employers to assess both technical competency and communication abilities."}
{"content": "Professional networking platforms enable ongoing engagement with the machine learning community through \"scientific publications\" and conference participation5. These activities demonstrate thought leadership and professional engagement beyond immediate job responsibilities."}
{"content": "Common Pitfalls and Strategic Avoidance Technical Presentation Errors"}
{"content": "Machine learning resumes frequently suffer from excessive technical jargon that obscures rather than clarifies capabilities. The guidance emphasizes avoiding \"overloading technical jargon\" in favor of clear communication that \"makes your point come across clearly\"13. Technical terms should be used judiciously to demonstrate expertise without alienating non-technical reviewers who may participate in initial screening processes."}
{"content": "Another common error involves neglecting to quantify achievements through specific metrics. Resumes must \"quantify accomplishments with measurable results\"13 rather than providing vague descriptions of responsibilities. The absence of concrete numbers makes it difficult for reviewers to assess actual impact and contribution levels."}
{"content": "Skill list comprehensiveness requires careful balance between demonstrating breadth and maintaining credibility. Candidates should avoid claiming expertise in technologies they have minimal experience with, as technical interviews will quickly expose superficial knowledge. However, strategic inclusion of related technologies can be appropriate when supported by transferable experience."}
{"content": "Structural and Content Mistakes"}
{"content": "Resume organization errors frequently undermine otherwise strong technical qualifications. The most common mistake involves \"ignoring soft skills\" that employers increasingly value13. While technical capabilities remain paramount, organizations seek candidates who can \"collaborate with cross-functional teams and present technical insights to non-technical stakeholders\"13."}
{"content": "Length and density management requires careful editorial judgment. While comprehensive experience documentation is important, excessive detail can overwhelm reviewers and obscure key qualifications. The goal involves presenting sufficient information to demonstrate qualifications while maintaining reader engagement throughout the document."}
{"content": "Content customization failures represent missed opportunities for competitive advantage. Generic resumes that fail to align with specific job requirements and organizational cultures significantly reduce success probability. Each application should reflect understanding of the target role and company context."}
{"content": "Conclusion and Strategic Recommendations"}
{"content": "The landscape of machine learning recruitment demands sophisticated understanding of diverse organizational expectations and strategic resume customization. Success requires balancing technical depth with clear communication, comprehensive experience documentation with concise presentation, and specialized expertise with demonstrated versatility."}
{"content": "For big tech positions, candidates should emphasize end-to-end machine learning experience, quantified achievements, and system design capabilities while ensuring ATS optimization through strategic keyword integration. Startup applications benefit from highlighting versatility, problem-solving orientation, and entrepreneurial mindset alongside technical qualifications."}
{"content": "The most effective approach involves maintaining multiple resume versions tailored to different organizational types while preserving core strengths and authentic professional identity. Continuous portfolio development, ongoing skill acquisition, and active professional engagement provide sustainable competitive advantages in this rapidly evolving field. Success ultimately depends on presenting technical expertise within compelling narratives that demonstrate both capability and cultural fit for target organizations."}
{"content": ""}
{"content": "How to Write Resume Bullets That Get Interviews\nWriting your resume? Here's how to write effective bullet points that convince an employer to invite you for an interview. Plus, get access to over 300 pre-written sample bullet points that you can use when writing your own resume.\nRecruiters don't read your resume. Instead, they skim through it."}
{"content": "That's why recruiters and hiring managers advise you use short, succinct bullet points, instead of long, wordy paragraphs to describe your achievements. Bullet points make your resume easy to skim and help hiring managers quickly get a sense of your previous achievements."}
{"content": "A framework to write effective resume bullet points\nSo what makes an effective resume bullet point? Well, the key is that each bullet point needs to demonstrate impact and highlight your experience in an effective way. To make it easy for you, here's a specific framework you can use as a checklist when writing each of your bullet points:"}
{"content": "Start your bullet point with a strong Action Verb (e.g. Created, Managed, Spearheaded, etc).\nAccomplishments, not responsibilities. Remember, your bullet points should always tell the recruiter or hiring manager what you accomplished, and not what you do on a day to day basis. \nIf you find yourself starting your bullet point with 'Responsible for', you're likely writing about your responsibilities and not your accomplishments.  \nAvoid using weak verbs like 'Assisted' or 'Helped'. These verbs don't clearly communicate your role in your achievement, and aren't specific enough in telling recruiters what you actually did. If you 'assisted' with something, you could have for example led the project or just participated in meetings. Of course, the latter is far less impactful.\nSimilarly, if you use the present tense, there's a pretty good chance you've just listed a responsibility - it's hard for something you have accomplished to be written in the present tense (e.g. use 'Managed', not 'Manage' nor 'Managing').\nQuantify your impact using numbers and metrics. Did your achievement save time for your team? Increase revenue? While you might not be able to do this for every bullet point, do it where you can.\nDon't use fillers (e.g. 'various', 'multiple'). Instead, be specific by using numbers (e.g. Don't say you 'implemented various features'. Instead, say you 'implemented 10+ features').\nRemove personal pronouns (e.g. I, my, their). It is understood that your resume is written about you and your experiences, and personal pronouns just take up space and increase wordiness.\n1-2 lines long. Short, succinct bullet points are key to your resume's readability. Blobs of text, that is bullets or paragraphs that are three lines or longer, are likely to not be read.\nExamples of resume bullet points\nUsing the above framework, let's go through a few examples of writing an actual bullet point that you can use on your resume. The first step is to think of a specific task or achievement from your previous role. If it's your first time writing your resume, start by writing down every fairly significant task you completed at your job."}
{"content": "Once you have that, let's add our action verbs and metrics, while also keeping in mind the rules we described above. Here's an example:"}
{"content": "Here's another example where we start with the impact we had. In this case, we describe how we reduced customer support calls."}
{"content": "Sample bullet points from top resumes\nIt's never easy writing your resume's bullet points, so use these examples to help you! If you find these samples useful, you should upgrade to Pro - you'll get access to 300+ bullet points from successful job seekers who got interviews at top-tier companies. You'll be able to a line similar to your own experience, tweak it and use it in your resume."}
{"content": "Created a performance reporting template, achieving an 80% reduction in the preparation time of standard client materials\nLed full redesign of website with findings from customer segmentation and competitive research, increasing website leads by 200%\nAnalyzed data from 25000 monthly active users and used outputs to guide marketing and product strategies; increased average app engagement time by 2x, 30% decrease in drop off rate, and 3x shares on social media\nLaunched Miami office with lead Director and recruited and managed new team of 10 employees. Grew office revenue by 200% in first nine months (representing 20% of company revenue)\nOrganized and advertised quarterly networking events with 500+ participants in six cities across California\nPromoted within 12 months due to strong performance and organizational impact - ahead of schedule by 12 months\nLed the transition to a paperless practice by implementing an electronic booking system and a faster, safer and more accurate business system; reduced cost of labor by 30% and office overhead by 10%\nNotice how each example uses the 6-point framework above. Pay close attention to the fact that all of them start with strong action verbs, use numbers and are accomplishment-oriented. These elements show your future employer what kind of impact you can have."}
{"content": "FAQs\nWhat are good bullet points for a resume?\nGood resume bullet points contain an action verb, are specific in describing your project/task and contain numbers to describe impact. A good litmus test is if a bullet point sounds like it could fit on a job description, it probably isn’t a good fit for your resume."}
{"content": "Should I use bullet points on my resume?\nYes! Bullet points make your resume easy to skim and help hiring managers quickly get a sense of your most impressive achievements."}
{"content": ""}
{"content": "Crafting a resume that effectively captures your expertise and achievements as a coach is a nuanced pursuit. Unlike work histories focused on traditional business competencies, coaching resumes must spotlight softer skills around empathy, inquiry, and change facilitation. They should articulate profound personal transformations fueled through your development partnerships with clients spanning leaders, creatives, healthcare providers or other niche roles."}
{"content": "This guide explores best practices for positioning your capabilities in a coaching resume configured to pass applicant tracking systems. You’ll discover how to quantitatively demonstrate leadership, career growth, health improvements or other niche impacts you’ve driven in client populations. Additionally, the latest formatting strategies are covered to ensure content clarity for both human and algorithmic screening. Follow these research-backed insights to compellingly showcase specialized abilities for coaching positions aligned to your distinct purpose and talents."}
{"content": "Highlighting Relevant Coaching Skills\nLead With Core Competencies\nAn effective coaching resume should highlight your most relevant skills and expertise upfront in a “core competencies” or “areas of expertise” section near the top. This allows hiring managers to quickly identify if you have the key abilities needed for the role."}
{"content": "For a coaching resume, essential competencies include communication skills, developing talent, fostering teamwork and collaboration, emotional intelligence, strategic thinking, problem-solving, active listening, assessing needs/goals, designing development plans, delivering effective feedback, and facilitating transformation."}
{"content": "Showcase Relevant Coaching Experiences\nIn your work experience and achievements sections, focus less on formal job titles and more on the specific coaching activities you have experience in. Relevant areas to highlight for a coaching resume include:"}
{"content": "Leadership Coaching: Helping executives, managers and emerging leaders develop new skills and behaviors to improve performance in roles with supervisory responsibilities.\nCareer/Professional Development Coaching: Empowering individuals to set meaningful career goals, navigate career changes, and develop leadership capabilities aligned to their aspirations.\nLife Coaching: Partnering with clients to identify personal goals and guiding positive changes related to relationships, health, work-life balance, or mindset.\nFor each relevant experience, use bullet points to demonstrate the methodologies you leveraged, types of assessments conducted, development plans created, and both measurable and transformational outcomes achieved for clients."}
{"content": "Spotlight Specializations (If Applicable)\nIf you have expertise coaching specific groups—such as athletes, executives, entrepreneurs, creatives, healthcare providers, etc.—include a section in your resume highlighting your background and success working with those clients. Discuss any specialized certifications earned, familiarity with industry-specific challenges, and relevant models/frameworks you apply in your practice."}
{"content": "You can also feature specialization in certain coaching formats like group facilitation, public speaking, published writing/thought leadership, or virtual/remote coaching capabilities."}
{"content": "Show You Walk The Talk\nAs a coach, it is especially important to model ongoing self-development, emotional intelligence, positivity, self-awareness, and ethics & integrity. Demonstrating these qualities will strengthen employers’ confidence in your ability to inspire change in others."}
{"content": "Include a stand-out profile section featuring brief testimonials, awards, press mentions, advanced certifications (such as PCC or MCC), volunteer work, or personal facts that showcase your coaching capabilities beyond your client work experience."}
{"content": "Key Coaching Skills to Demonstrate\tExample Resume Bullet Points\nActive Listening & Powerful Questioning\tDevelop insightful, open-ended questions that reveal clients’ authentic goals, motivations and mental barriers holding them back from change\nAssessing Needs & Establishing Measurable Goals\tPinpoint developmental opportunities using 360 assessments; Collaborate to define tangible, results-oriented development goals clients connect with emotionally\nDesigning Development Plans\tCurate personalized learning pathways to increase self-awareness and build new leadership capabilities in a caring, strengths-focused way\nGuiding Sustainable Behavioral Change\tCombine proven coaching techniques with research in positive psychology and neuroscience to promote real change; Celebrate client wins while maintaining accountability to development plans\nQuantifying Coaching Success and Impact\nAn effective coaching resume provides concrete evidence of your ability to positively impact clients and organizations. Quantify your coaching success by highlighting relevant key performance indicators (KPIs) and metrics that hiring managers value."}
{"content": "Tailor the metrics you include to resonate with the reader and role. For example, leadership coaches may feature promotion rates, employee engagement scores, productivity increases, decreases in turnover, or rises in 360-review leadership competency scores for their clients. Career coaches could highlight improvements clients achieved in job offer rates, salary increases, new skills acquired, or speed of landing a new role."}
{"content": "Demonstrate Strong ROI and Business Impact\nHiring managers want to understand the tangible benefits you drove as a coach, such as return on investment. For each major coaching engagement, include metrics conveying the business value clients obtained:"}
{"content": "Percentage improvements in key performance metrics\nIncreases in productivity, sales, customer satisfaction scores\nDecreases in turnover, absenteeism, costs\nFaster promotions, internal fill rates for openings\nAlso highlight any formal recognitions of excellence you earned from clients including awards, repeat business, referrals or testimonials."}
{"content": "Leverage Hard Data From Assessments\nInclude measurable pre-and post-coaching outcomes from validated instruments to quantify improvements. Relevant assessment data may involve:"}
{"content": "360-reviews: Increased leadership, communication, strategic thinking competency scores\nDiSC profiles: Gains in productivity, collaboration, adaptability\nEmotional intelligence tests: Better self-awareness, empathy, relationship skills\nStrengths assessments: Enhanced resilience, confidence, well-being\nPersonality inventories: Improvements in decision-making, planning, focus\nFor each assessment, succinctly convey the specific positive changes achieved in capability areas directly tied to coaching goals. Compare post-coaching versus initial scores using percentages or points gained."}
{"content": "Coaching Client\tAssessment Used\tKey Metric(s) Improved\tQuantified Pre-Post Change\nExecutive\tHogan Personality Inventory\tPrudence; Intellectance\t+18%; +12%\nManager\tLeadership Versatility Index 360\tInfluencing, Engaging, Resoluteness\t+14 pts; +11 pts; +9 pts\nIndividual Contributor\tVOICES Values Assessment\tBenevolence; Universalism\t+21%; +19%\nCapture Transformational Outcomes\nWhile metrics provide tangible evidence of success, anecdotal examples of profound personal or professional breakthroughs can powerfully convey life-changing impact. Describe 1-2 client scenarios where your coaching facilitated meaningful, sustainable improvements conveying the depth of transformation achieved."}
{"content": "Potential examples include an insecure new leader who gained the confidence needed to manage cross-functional teams effectively; an executive struggling with work-life balance who implemented boundaries that improved family relationships; or a unsatisfied employee lacking direction who discovered a new career purpose and secured a dream role."}
{"content": "Formatting for Applicant Tracking Systems\nMost large organizations use applicant tracking systems (ATS) to automatically scan resumes and job applications for relevant keywords indicating fit for open positions. As a coach, include key coaching competencies like leadership development, performance improvement, organizational development, and terms associated specifically with the role you are pursuing."}
{"content": "Also incorporate keywords from the job posting like required certifications (PCC, MCC), methodologies (GROW model), assessments (DiSC), software (Zoom, Salesforce), industries, etc. Use these exact terms—not just synonyms—so the ATS registers relevancy. Balance using sufficient keywords to pass screening while keeping content authentic and results-focused."}
{"content": "Optimize Structure and Formatting\nATS scans for headings, bold/italicized text, and bullet points to parse information and score applicant-job fit. So structure your resume content accordingly using:"}
{"content": "Main section headings for Experience, Skills, Education, etc.\nBolded subtitles to highlight employers, job titles/dates, credentials\nBulleted achievement statements showcasing impact and metrics\nTables to convey assessment outcomes, testimonials, stats, etc.\nAdditionally, choose clear, consistent font styles and sizes appropriate for online viewing. Use white space strategically to direct readers’ attention. Careful formatting enhances scannability for both ATS algorithms and hiring managers."}
{"content": "Check Compatibility Before Submitting\nSince ATS platforms parse resume content and structure differently, always verify formatting compatibility before applying. Use sites like Jobscan to test how well your document matches the job posting based on keyword usage, skills alignment and ATS readability. Refine areas flagged to boost potential of passing initial screening stages."}
{"content": "Additionally, convert any tables, graphs or images into ATS-friendly text formats. Avoid vertical text, columns, or text boxes. Validate file type uploads if required formats are specified. With careful formatting considerations, you can optimize resume performance to showcase top coaching qualifications."}
{"content": "ATS-Friendly Resume Tips\tExample Actions for Coaches\nUse relevant keywords from job posting\tIncorporate terminology like “PCC certification,” “DiSC,” “leadership development,” “performance improvement”\nFeature key sections with clear headers\tAdd sections titled “Coaching Credentials,” “Core Competencies,” “Methodologies”\nInclude well-formatted bullet points\tShowcase skills and achievements in easy-to-scan bulleted lists\nUse common fonts and headings\tStick to simple, legible fonts like Arial; Use standard H2, H3 tags for bold headings\nEmphasizing Leadership and People Development\nFor coaches focused on developing leaders and high-potential talent, ensure your resume highlights relevant leadership coaching experiences. Discuss specific engagements where you:"}
{"content": "Partnered with C-suite leaders and emerging managers to pinpoint development needs using 360 reviews, personality assessments, skills gap analyses, etc.\nDesigned customized programs leveraging modalities like one-on-one coaching, cohort learning, job assignments, and action learning to target capabilities required for upper management roles\nFacilitated transitions to broader responsibilities, enhanced strategic influence, improved cross-functional collaboration, drove culture change initiatives, or resolved complex team dynamics issues\nQuantified outcomes such as competency gains on 360 performance indexes, higher employee engagement scores for teams managed post-coaching, smoother succession planning implementation, etc.\nDemonstrate People Development Impacts\nFor coaches guiding broader professional growth and talent development initiatives, include measurable people development outcomes you have enabled such as:"}
{"content": "Increases in high-potential employee readiness for advancement roles by specified percentage year-over-year\nReductions in voluntary turnover rates for populations coached on career progression options\nRises in employee productivity, work output, sales growth attributed to new skills/behaviors from coaching engagements\nFaster new hire onboarding and role proficiency milestones due to coaching reinforcement\nExpanded rates of employees meeting annual performance improvement plan goals via coaching support\nDiscuss how your coaching approach drives cultural transformation, promotes inclusion, increases engagement, and empowers authentic, purpose-driven leadership at all levels to convey full people development impact."}
{"content": "Showcase Methodologies That Resonate\nTailor the specific methodologies you highlight to align with leadership development priorities the hiring organization values. Relevant examples include:"}
{"content": "Transformational Coaching: Facilitate positive self-transformation founded on trust, integrity, honesty and compassion to drive authentic, purpose-guided leadership\nOntological Coaching: Enable fundamental mindset and behavioral shifts using language, embodiment, temporality and mood competencies to elevate leadership presence\nMarshall Goldsmith Stakeholder Centered Coaching: Motivate change through client chosen goals based transparent stakeholder feedback on key leadership weaknesses to address\nImmunity to Change: Reveal hidden competing commitments that sabotage achievement of adaptive leadership goals and design experiments to test overcoming identified immunity system\nTeam Coaching: Harness group dynamics principles and systems thinking to foster shared responsibility, boost resilience, enhance decision-making, and strengthen team leader capabilities\nArticulate how your coaching approach drives sustained improvements rather than temporary or superficial change in leadership capacities over the long-term."}
{"content": "Leadership Competency\tOutcomes from Developmental Coaching\nStrategic Decision-Making\t+38% increase in 360 scores for long-term thinking; Reduced reactive choices and cultivated analysis of future impacts\nDelegation and Empowerment\tExpanded direct reports’ scope by 22%; Raised team capability ratings by 14 pts; Improved work-life balance\nExecutive Presence and Gravitas\tFostered C-suite image congruent with authentic self through presence coaching; Credibly led high-stakes initiatives\nDriving Successful Change\tCut project costs by 19% and accelerated timelines by 35% via transformational leadership principles\nVerify Leadership Coaching Credentials\nWhile resumes emphasize competencies over credentials, hiring leaders value seeing applicable certifications that verify your expertise coaching executives and managers. Relevant designations may include:"}
{"content": "ACC, PCC, or MCC certifications from the International Coaching Federation (ICF)\nCertified Professional Coach from the International Society of Coaching\nBoard Certified Coach from the Center for Credentialing and Education\nQualified Administrator of Intercultural Development Inventory\nCertified Dare to LeadTM Facilitator; Leadership Circle Certification\nShowcasing accredited coach training focused explicitly on optimizing leadership, cultural transformation, change management, team acceleration, and organizational development further strengthens your leadership development qualifications."}
{"content": "Customizing for Specific Coaching Roles\nCustomize your resume to align with specialized experience required for the specific type of coaching role you are pursuing, such as executive coaching, career coaching, life coaching, health/wellness coaching, business/performance coaching, etc. Articulate any previous positions held in relevant niches that enable you to uniquely relate to and empower those clients."}
{"content": "For instance, highlight HR consulting, training or OD roles on an executive/leadership development coach resume. Feature relevant corporate or nonprofit experience for career coaches. List credentials in psychology, social work or counseling for life coaches. Showcase medical, nursing, nutrition or fitness backgrounds for health/wellness coaches. This domain expertise strengthens rapport, credibility and contextual understanding."}
{"content": "Showcase Specialized Coaching Methodologies\nDemonstrate expertise applying coaching techniques tailored for the specific needs and objectives of your niche clientele. For example, outline the proprietary frameworks used to guide executives, systems leveraged to motivate behavioral change for health goals, or processes employed to facilitate entrepreneurial growth."}
{"content": "Where relevant, highlight coaching specializations like:"}
{"content": "Team/Group Coaching\nAsynchronous & Virtual Coaching\nPublic Speaking/Presenting\nWriting/Thought Leadership\nIncorporating Assessments\nOverseas/Global Experience\nCustomizing displayed competencies, tools and techniques to those highly valued in your particular subfield strengthens perceived ability to address niche needs."}
{"content": "Quantify Specialized Outcomes\nInclude metrics showcasing the tangible impact you have driven specifically within your area of coaching expertise. For example, career coaches may highlight:"}
{"content": "Shortened client job transition times from role exit to offer by average of X weeks\nIncreased client job offer salaries by average of Y% over previous position\nZ% of clients landing roles better aligned to purpose/passion as a result of coaching\nWhile leadership development coaches may feature:"}
{"content": "X% faster promotion rates for coached rising leaders\nY% higher employee retention on teams led by coaching program graduates\nZ pt average increases in multi-rater leadership versatility scores from pre-post coaching\nInclude relevant metrics and client examples conveying transformational niche impacts that persuasively showcase abilities."}
{"content": "Coaching Specialization\tSample Specialized Metrics\nHealth and Wellness\tBMI reduced average of X lbs in client population\nCareer Transition\tX% shorter job search durations; Y% salary increases\nEntrepreneur/Founder\tX% average client business expanded revenues year-over-year\nList Niche Credentials\nInclude certifications and specialized training demonstrating deep expertise coaching specific groups. For example:"}
{"content": "Executive Coaches may highlight ACC, PCC, MCC credentials, Leadership Circle Certification, Stanford Executive Program Certificates, etc.\nCareer Coaches can showcase Certified Career Counselor, Certified Career Services Provider, Certified Job & Career Transition Coach, etc.\nLife Coaches may feature Positive Psychology Certification, Certified Personal & Executive Coach, Certified Mindset Coach, etc.\nListing respected credentials required for your niche qualifies you to add value. However, primarily emphasize demonstrated competencies, transformation outcomes and client results."}
{"content": "Optimizing With Career Coaches’ Input\nAs a coach, getting unbiased input on your resume from fellow coaching professionals can reveal valuable insights you may overlook. Ask colleagues who understand the profession to review your document through the lens of what resonates most with the empathy, compassion and wisdom of a coach. Their suggestions can strengthen your brand as an authentic, purpose-driven leader committed to development and growth."}
{"content": "Areas for coaches to assess include: Does your resume exude emotional intelligence grounded in self- and social awareness? Are you leading with core competencies that highlight active listening, powerful questioning, trust-building and change facilitation? Do you demonstrate coaching presence via relatable experiences and transformational outcomes? Their seasoned perspectives can ensure your resume aligns to the coaching mindset hiring leaders want."}
{"content": "Get Feedback From Hiring Managers\nAdditionally, connect with managers involved in recruiting coaching roles to obtain direct input on what competencies and achievements persuade them. Inquire about their top assessment criteria: What coaching backgrounds ignite interest? What evidence of driving change compels interviews? What transformation examples illustrate life-changing impact? Understanding exact priorities enables tailoring content accordingly."}
{"content": "Coaching often facilitates self-discovery through others’ eyes. Inviting manager reactions to a draft resume provides that. Ask targeted questions: Does my resume effectively convey the personalization I bring clients? Are metrics and outcomes compelling and clear? Would this document motivate you to meet me? Refining messaging informed by the source – hiring decision-makers – can powerfully optimize resume performance."}
{"content": "Have a Professional Resume Writer Review\nPartnering with a professional resume writing service specializing in coaches equips you with an expert resume strategist to elevate your resume. Qualified writers understand how to translate coaching skills into compelling value propositions using optimized messaging and formatting tailored to industry norms and applicant tracking systems (ATS)."}
{"content": "An experienced writer helps coaches authentically “walk the talk” in showcasing their personal brands by:"}
{"content": "Highlighting emotional intelligence and strategic influence capabilities conveying thought leadership\nDemonstrating coaching mindsets embracing self-awareness, growth, vulnerability and service\nQuantifying transformation outcomes positioning you as a change catalyst\nOptimizing ATS-friendly keywords and formatting to pass screening\nInvesting in qualified professional support elevates resume quality and enables confidently pursuing openings knowing your experience shines."}
{"content": "Key Resume Reviewer\tFeedback Gained\nFellow Coaches\tAssess alignment conveying coaching values like compassion, vulnerability, wisdom\nHiring Managers\tPinpoint which competencies, outcomes and metrics directly persuade interview decisions\nResume Writers\tElevate messaging and format tailored to coaching qualifications priorities\nCheck Mobile and Accessible Formatting\nWith many recruiters reviewing resumes on small mobile screens, carefully inspect how your document renders on phones and tablets. Ensure all headings, text formatting and tables convert legibly without restrictive horizontal scrolling or formatting quirks compromising experience. Running your file through online accessibility checkers like webaim.org and accessibilitychecker.org also catches issues impacting those using screen readers."}
{"content": "Additionally, test conversions to plaintext format. Since ATS systems frequently extract and analyze text from submitted resumes, verify readability. Plain rendering should:"}
{"content": "Preserve reasonably equivalent content flow and structure\nShowcase competencies and achievements without loss of impact\nRetain sufficiently compelling messaging for recruiting decision-makers reviewing extracted text\nEnsuring resumes render optimally on mobile screens and in basic text builds adaptive capability allowing your qualifications to shine through regardless of reviewer mode."}
{"content": "Platform\tResume Optimization Tips\nMobile\tReview on multiple phones/tablets; Check horizontal scrolling\nAccessibility\tUse online checkers to identify issues for screen readers\nPlaintext\tValidate quality content flow without formatting, headings\nRefresh Resumes Regularly\nAs a coach focused on continual growth and development, revisit your resume at least annually to incorporate new capabilities, outcomes, credentials and techniques that evolve over time. Set calendar reminders to reassess alignment with current experience. Update competencies developed, new methodologies applied in practice and expanded niches served based on coaching engagements over the past year. Add fresh transformation success stories and metrics conveying your sustained positive impact over time."}
{"content": "Also, evolve formatting and content to resonate with trends in priorities hiring managers currently value most. Refresh visual design elements using updated resume layout examples reflecting current best practices as well. This regular reboot keeps your resume compelling, competitive and closely aligned with your progress as a skilled coach."}
{"content": "Conclusion\nCrafting an effective coaching resume requires showcasing specialized skills in empathy, inquiry, and change facilitation. By leading with emotional intelligence grounded in authenticity, strategically quantifying your ability to drive transformation, and aligning to current applicant tracking system priorities, you can compellingly position your distinct purpose and talents."}
{"content": "This guide illuminated best practices for highlighting relevant competencies, methodologies and outcomes that persuasively capture expertise coaching leaders, teams or individuals. Additionally, insights on refreshing your resume regularly and obtaining unbiased feedback from peers and hiring managers helps ensure optimal, competitive messaging. By following these research-backed strategies, you can confidently demonstrate development partnership impacts that empower meaningful growth."}
{"content": "How long does a recruiter spend with your resume? On average, about 7.4 seconds."}
{"content": "That’s a long time in a bull-riding competition, but barely any time to make an impression."}
{"content": "If that quick glance shows promise, recruiters will continue reading and potentially hand it off to the hiring manager — which means you have a chance to get the job."}
{"content": "If they don’t see a fit in those 7.4 seconds, however, your resume will likely end up at the bottom of the pile — ultimately sinking your chances of getting the job."}
{"content": "So, those seven to eight seconds mean a lot. The key is writing a resume that will connect with recruiters in that short span of time. In her LinkedIn Learning course, Making Recruiters Come to You, longtime recruiter and career coach J.T. O’Donnell explains exactly how to do that."}
{"content": "In her LinkedIn Learning course, longtime recruiter J.T. O’Donnell explains how to write a resume that'll actually get a recruiter's attention."}
{"content": "Key tactics to writing a resume recruiters will actually read\nIn her course, O’Donnell introduces several key tactics to make your resume pass a seven-second scan:"}
{"content": "Show, don’t tell."}
{"content": "Don’t write something like “you are a strategic, innovative self-starter who loves collaboration” on your resume."}
{"content": "Instead, tell the facts that make that point. Write how you started your own company from scratch or launched a project on your own. Or how you were in the top five percent of salespeople at your company six years in a row. Or how you’ve been promoted at every job you’ve ever had."}
{"content": "Those facts will impress recruiters far more than any adjective could. List your skills at the top of the resume."}
{"content": "Near the top of your resume, even above your job history, write out your skills. This allows recruiters to quickly scan them to make sure you have what’s needed to do the job."}
{"content": "And, of course, be sure to only list skills that are pertinent to the job you’re applying for."}
{"content": "Ensure your work history on your resume mirrors your work history on your LinkedIn profile."}
{"content": "If these don’t match up, it's a red flag. So ensure that they do. Also be sure to add your skills to your LinkedIn profile."}
{"content": "Keep the margins somewhat wide and the font somewhat big."}
{"content": "You don’t want your margins to be smaller than 0.8 inches or use a font less than 11. Why?"}
{"content": "First off, this will make your resume more appealing to the eye. Second, the last thing a recruiter wants to do is squint to read your resume — that’ll almost guarantee it doesn’t get read."}
{"content": "But, what if you can't fit everything? Then cut, cut, cut. Which brings us to the next point..."}
{"content": "For a resume, less is often more."}
{"content": "You don’t need to list every job you’ve ever had on your resume. And you also don’t need to list every skill you’ve ever mastered."}
{"content": "Instead, just highlight the skills and the jobs that are relevant to the role you are applying for right now. Keeping the focus on what recruiters will be looking for will help you keep it shorter and allow for the right things to stand out during that seven-second pass."}
{"content": "“I tell job seekers this all the time,” O’Donnel says in her course, “if a recruiter calls you and says, ‘Hi, I found you on LinkedIn and I checked out your resume, but I need more information’ — you know you've done this right. You gave them just enough to want to connect with you.”"}
